
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ТАБЛИЧНЫМ ПОЛЕМ ОСНОВНЫЕСРЕДСТВА

&НаКлиенте
Процедура ОсновныеСредстваПриАктивизацииСтроки(Элемент)
	
	ИмяТабличнойЧасти = "ОсновныеСредства";
	РаботаСТабличнымиЧастямиКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "Комплектующие");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередУдалением(Элемент, Отказ)
	
	ИмяТабличнойЧасти = "ОсновныеСредства";
	РаботаСТабличнымиЧастямиКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтаФорма, "Комплектующие");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ОсновноеСредство = "";
	КонецЕсли;
	
	ИмяТабличнойЧасти = "ОсновныеСредства";
	Если НоваяСтрока Тогда

		РаботаСТабличнымиЧастямиКлиент.ДобавитьКлючСвязиВСтрокуТабличнойЧасти(ЭтаФорма);
		РаботаСТабличнымиЧастямиКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "Комплектующие");
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ТАБЛИЧНЫМ ПОЛЕМ КОМПЛЕКТУЮЩИЕ

&НаКлиенте
Процедура КомплектующиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ИмяТабличнойЧасти = "ОсновныеСредства";
	Отказ = РаботаСТабличнымиЧастямиКлиент.ПередНачаломДобавленияВПодчиненнуюТабличнуюЧасть(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ИмяТабличнойЧасти = "ОсновныеСредства";
	Если НоваяСтрока Тогда
		РаботаСТабличнымиЧастямиКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтаФорма, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ТолькоПросмотр = ОбщегоНазначения.ВозможностьИзменятьДанныеВДокументе(ЭтотОбъект);
	//Если ЭтоНовый() Тогда
	//	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	//	Событие 		= Справочники.СобытияОС.ВводОстатковОС;
	//КонецЕсли;
	
КонецПроцедуры
