
//// Функция возвращает документ поступления для справочника ОсновныеСредства.
////
//// Параметры:
////	Объект           			- ДанныеФормыСтруктура - Данные документа
////	Форма            			- Форма документа
////	Организация      			- СправочникСсылка.Организации - Организация, для которой формируется документ поступления
////	ТекстДокументПоступления 	- Строка - Текст, указанный в поле счет-фактура
////	Поле - ПолеФормы 			- Поле формы для документа поступления
////	НеТребуется      			- Булево - Истина - для справочника не требуется вводить документ поступления
////
//Функция ВвестиДокументПоступления(Объект, Форма, Организация, ТекстДокументПоступления, Поле = Неопределено, НеТребуется = Ложь) Экспорт
//	
//	ДокументПоступления = Неопределено;
//	Гиперссылка = Истина;
//	ВводитьДокументПоступления = Не НеТребуется;
//	
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		ТекстДокументПоступления = ЗаполнениеДокументовКлиент.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка, ДокументПоступления);
//	КонецЕсли;
//	
//	НовыйТекстДокументПоступления = "";
//	Если Не ЗначениеЗаполнено(ДокументПоступления)
//		И ВводитьДокументПоступления Тогда
//		
//		СтруктураОснование = Новый Структура("ОсновноеСредство", Объект.Ссылка);
//		
//		НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Основание", СтруктураОснование));
//		Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
//			НовыйТекстДокументПоступления = ЗаполнениеДокументовКлиент.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
//		КонецЕсли;
//	Иначе
//		Если ЗначениеЗаполнено(ДокументПоступления) Тогда
//			НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Ключ", ДокументПоступления));
//			Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
//				НовыйТекстДокументПоступления = ЗаполнениеДокументовКлиент.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если Не ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
//		ТекстДокументПоступления = НовыйТекстДокументПоступления;
//	КонецЕсли;
//	
//	Если Поле <> Неопределено Тогда
//		Если Поле.Гиперссылка <> Гиперссылка Тогда
//			Поле.Гиперссылка = Гиперссылка;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ТекстДокументПоступления;
//	
//КонецФункции // ВвестиДокументПоступления

//Функция СоздатьОткрытьДокументПоступления(ИмяФормыОбъекта, ПараметрыОткрытияФормы) Экспорт
//	
//	Возврат	ОткрытьФормуМодально(ИмяФормыОбъекта, ПараметрыОткрытияФормы);
//	
//КонецФункции //СоздатьОткрытьДокументПоступления	

//// Функция формирует представление документа поступления.
////
//// Параметры:
//// Номер - Строка - Номер документа поступления
//// Дата  - Дата - Дата документа поступления
////
//// Возвращаемое значение:
//// Строка - Представление документа поступления
////
//Функция ПредставлениеДокументаПоступления(Номер, Дата) Экспорт
//	
//	Возврат "№ " + СокрЛП(Номер) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + " г.";
//	
//КонецФункции // ПредставлениеДокументаПоступления


//// Функция формирует текст счета-фактуры документа продажи.
////
//// Параметры:
////	ДокументСсылка - Текущий документ
////	Организация    - СправочникСсылка.Организации - Организация, для которой формируется счет-фактура
////	Поле - ПолеФормы - Поле формы для счета-фактуры
////	НеТребуется - Булево - Истина - для документа не требуется вводить счет-фактуру
////
//// Возвращаемые параметры:
////	Гиперссылка - Булево - Признак показа гипер-ссылки для поля счет-фактуры
////	СчетФактура - ДокументСсылка.СчетФактураВыданный - Найденный счет-фактура
////
//// Возвращаемое значение:
////  Строка - Текст счета-фактуры
////
//Функция ТекстДокументаПоступления(ОсновноеСредство, Организация = Неопределено, Поле = Неопределено, НеТребуется = Ложь, Гиперссылка = Истина, ДокументПоступления = Неопределено) Экспорт
//	
//	Перем РеквизитыДокументаПоступления;
//	
//	ДокументПоступления = Документы.ПоступлениеОС.ДокументПоступления(ОсновноеСредство, РеквизитыДокументаПоступления);
//	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
//		ТекстДокументаПоступления = ПредставлениеДокументаПоступления(РеквизитыДокументаПоступления.Номер, РеквизитыДокументаПоступления.Дата);
//		Гиперссылка = Истина;
//		
//	ИначеЕсли НеТребуется Тогда
//		ТекстДокументаПоступления = "Не требуется";
//		Гиперссылка = Ложь;	
//		
//	ИначеЕсли Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПоступлениеОС) Тогда
//		ТекстДокументаПоступления = "Не введена";
//		Гиперссылка = Ложь;
//		
//	Иначе
//		ТекстДокументаПоступления = "Создать документ поступления";
//		Гиперссылка = Истина;
//		
//	КонецЕсли;
//	
//	Если Поле <> Неопределено Тогда
//		Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПоступлениеОС) Тогда
//			Поле.Гиперссылка = Ложь;
//		Иначе
//			Если Поле.Гиперссылка <> Гиперссылка Тогда
//				Поле.Гиперссылка = Гиперссылка;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ТекстДокументаПоступления;
//	
//КонецФункции // ТекстДокументаПоступления
