
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, , "ГруппаДополнительныеРеквизиты", Истина);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если СсылкаНаОбъект <> Элементы.Список.ТекущаяСтрока Тогда
		СсылкаНаОбъект = Элементы.Список.ТекущаяСтрока;
		
		//ПодключитьОбработчикОжидания("СписокПослеАктивизацииСтроки", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура СписокПослеАктивизацииСтроки()
	
	ЗаполнитьДополнительныеРеквизитыВФорме();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыВФорме()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(
			ЭтаФорма, СсылкаНаОбъект.ПолучитьОбъект());
	Иначе
		УправлениеСвойствами.УдалитьСтарыеРеквизитыИЭлементы(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

