
 Функция ПолучитьТаблицуЗакупки(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	                |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	                |	1 КАК Количество,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства КАК ВидОсновногоСредства
	                |ИЗ
	                |	Документ.ПокупкаПоддержкиЛицензий.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий	
 
 Функция ПолучитьТаблицуПоддержкиЛицензий(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.СрокДействия_Месяц,
	                |	ДокументПоступления.ДатаНачалаПоддержки КАК ДатаНачала
	                |ИЗ
	                |	Документ.ПокупкаПоддержкиЛицензий.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий	

