&НаСервере
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ЗаполнитьОстаткиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СправочникОсновныеСредства.Ссылка КАК Лицензия,
	               |	СправочникОсновныеСредства.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ЛицензииОрганизацииОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК СправочникОсновныеСредства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛицензииОрганизации.Остатки(, Организация = &Организация) КАК ЛицензииОрганизацииОстатки
	               |		ПО СправочникОсновныеСредства.ИдентификаторПрограммы = ЛицензииОрганизацииОстатки.ИдентификаторПрограммы
	               |			И СправочникОсновныеСредства.Ссылка = ЛицензииОрганизацииОстатки.Лицензия
	               |ГДЕ
	               |	СправочникОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.Лицензия)
	               |	И НЕ ЛицензииОрганизацииОстатки.КоличествоОстаток ЕСТЬ NULL 
	               |	И НЕ СправочникОсновныеСредства.ЭтоГруппа
	               |	И СправочникОсновныеСредства.ИдентификаторПрограммы В (&СписокИдентификаторов)";
				   
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокИдентификаторов", УправлениеОсновнымиСредствамиСервер.ВернутьИдентификаторыАналогаНаСервере(ИдентификаторПрограммы));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ЗаполнитьОстаткиНаСервере()
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	ИдентификаторПрограммы = Параметры.ИдентификаторПрограммы;
	
	Элементы.ТаблицаЛицензий.РежимВыбора = Параметры.РежимВыбора;
	
	ТаблицаЛицензий.Загрузить(ЗаполнитьОстаткиНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛицензийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ТаблицаЛицензий.ТекущиеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru = 'Выберите лицензию.'"));
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Элемент.ТекущиеДанные.Лицензия;
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаЛицензийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	РезультатВыбора = Элемент.ТекущиеДанные.Лицензия;
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

