&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресДанныхВХранилище)
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	
	Для каждого СтрокаЗагрузки Из СтруктураДанных.ТаблицаНеобходимыхЛицензий Цикл
		
		НоваяСтрока = Объект.Лицензии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	
	КонецЦикла;
	
	Для каждого СтрокаЗагрузки Из СтруктураДанных.ТаблицаНеобходимойПоддержки Цикл
		
		НоваяСтрока = Объект.Поддержка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиенте
Процедура ПолучитьНеобходимоеДанные(Команда)
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("ДатаАнализа", 		Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",		Объект.Организация);
	
	АдресДанныхВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ПолучениеДанныхОЗакупках", ПараметрыПодбора);
	
	Если ЗначениеЗаполнено(АдресДанныхВХранилище) Тогда
		ПолучитьЗапасыИзХранилища(АдресДанныхВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостьЛицензииНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьСтоимостьюПоПрограммам(Объект, "Лицензии", Истина, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостьЛицензии(Команда)
	ЗаполнитьСтоимостьЛицензииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостьПоддержкиНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьСтоимостьюПоПрограммам(Объект, "Поддержка", Ложь, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостьПоддержки(Команда)
	ЗаполнитьСтоимостьПоддержкиНаСервере();
КонецПроцедуры
