
// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеОССведенияОС.Ссылка КАК Регистратор,
	               |	ПоступлениеОССведенияОС.Ссылка.Дата КАК Период,
	               |	ПоступлениеОССведенияОС.ОсновноеСредство,
	               |	ПоступлениеОССведенияОС.Ссылка.Организация КАК Организация,
	               |	ПоступлениеОССведенияОС.ПодразделениеОрганизации,
	               |	ПоступлениеОССведенияОС.МОЛ КАК МОЛ,
	               |	ПоступлениеОССведенияОС.Помещение КАК Помещение,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОСВладелец,
	               |	ПоступлениеОССведенияОС.ИмяДомена
	               |ИЗ
	               |	Документ.ПоступлениеОС.СведенияОС КАК ПоступлениеОССведенияОС
	               |ГДЕ
	               |	ПоступлениеОССведенияОС.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

 //Комиссаров: 29/07/2013
 Функция ПолучитьТаблицуЗакупки(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	                |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	                |	ДокументПоступления.Количество КАК Количество,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства КАК ВидОсновногоСредства
	                |ИЗ
	                |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий	

Функция ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументПоступления.Ссылка.Организация,
	               |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	               |	ДокументПоступления.Количество,
	               |	ДокументПоступления.Ссылка.Дата КАК Период,
	               |	ДокументПоступления.Ссылка КАК Регистратор,
	               |	ДокументПоступления.НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	               |ГДЕ
	               |	ДокументПоступления.Ссылка = &Ссылка
	               |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &ВидОсновногоСредства";
				   
				   
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("ВидОсновногоСредства", Справочники.ВидыОсновногоСредства.Лицензия);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуЛицензииОрганизации

Функция ПолучитьТаблицуРазмещениеОбъектов(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументПоступления.Ссылка.Организация,
	               |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	               |	ДокументПоступления.Количество,
	               |	ДокументПоступления.Ссылка.Дата КАК Период,
	               |	ДокументПоступления.Ссылка КАК Регистратор,
	               |	ДокументПоступления.НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	               |ГДЕ
	               |	ДокументПоступления.Ссылка = &Ссылка
	               |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &ВидОсновногоСредства";
				   
				   
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("ВидОсновногоСредства", Перечисления.ВидОсновногоСредства.ПрограммноеОбеспечение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуРазмещениеОбъектов	
//Комиссаров

// Функция находит документ поступления для заданного основного средства.
//
// Параметры:
//	ОсновноеСредство - Основное средство, для которого необходимо найти счет-фактуру
//
// Возвращаемые параметры:
//	РеквизитыДокументаПоступления - Структура - Номер и дата документа поступления
//
// Возвращаемое значение:
//	ДокументСсылка.ПоступлениеОС - Найденный документ
//
Функция ДокументПоступления(ОсновноеСредство, РеквизитыДокументаПоступления = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДанныеДокумента.Ссылка КАК ДокументПоступления,
	               |	ДанныеДокумента.Ссылка.Номер,
	               |	ДанныеДокумента.Ссылка.Дата,
	               |	ДанныеДокумента.Ссылка.Организация
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.ОсновноеСредство = &ОсновноеСредство
	               |	И НЕ ДанныеДокумента.Ссылка.ПометкаУдаления";
	
	
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	ДокументПоступления = Документы.ПоступлениеОС.ПустаяСсылка();
	РеквизитыДокументаПоступления = Новый Структура("Номер, Дата, Организация");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументПоступления = Выборка.ДокументПоступления;
		ЗаполнитьЗначенияСвойств(РеквизитыДокументаПоступления, Выборка);
	КонецЕсли;
	
	Возврат ДокументПоступления;
	
КонецФункции // СчетФактураДокумента()
