////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Исполнители, 
		"РольИсполнителя", Параметры.РольИсполнителя, ВидСравненияКомпоновкиДанных.Равно);
	СвойстваРоли = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.РольИсполнителя, "ИспользуетсяСОбъектамиАдресации,ТипыДополнительногоОбъектаАдресации,ТипыОсновногоОбъектаАдресации");
	Если Не СвойстваРоли.ИспользуетсяСОбъектамиАдресации Тогда
		Если Не ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83БезРежимаСовместимости() Тогда
			Исполнители.Группировка.Элементы[0].Использование = Ложь; // ОсновнойОбъектАдресации
			Исполнители.Группировка.Элементы[1].Использование = Ложь; // ДополнительныйОбъектАдресации
		КонецЕсли;
	ИначеЕсли СвойстваРоли.ТипыДополнительногоОбъектаАдресации.Пустая() Тогда
		Если Не ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83БезРежимаСовместимости() Тогда
			Исполнители.Группировка.Элементы[1].Использование = Ложь; // ДополнительныйОбъектАдресации
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
