&НаСервере
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СформироватьНаСервере()

	Объект.Элементы.Загрузить(УправлениеЛентойНовостейСервер.ПолучитьСодержимоеЛенты());

КонецПроцедуры // СформироватьНаСервере()
 

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	Если Объект.Элементы.Количество() > 0 Тогда
		Элементы.Элементы.ТекущаяСтрока = Объект.Элементы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СохранитьНаСервере()

	СодержимоеЛенты = Объект.Элементы.Выгрузить();
	УправлениеЛентойНовостейСервер.ЗаписатьСодержимоеЛенты(СодержимоеЛенты);

КонецПроцедуры // СохранитьНаСервере()


&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	Предупреждение("Обработка завершена");
	
КонецПроцедуры



 
