
&НаСервере
// Функция возвращает пользовательские настройки.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Пользовательские настроки отчета усОстаткиТоваров
//
Функция ПолучитьПользовательскиеНастройки(ТекущийОтчет, СтруктураПараметров)

    ПользовательскиеНастройки = ОбщегоНазначенияСервер.ПолучитьПользовательскиеНастройки(ТекущийОтчет, СтруктураПараметров.СтруктураОтбора, СтруктураПараметров.КлючВарианта);
    Возврат ПользовательскиеНастройки;

КонецФункции // ПолучитьПользовательскиеНастройки()


&НаКлиенте
Процедура ЗапуститьОтчет(Команда)
	
	СтруктураОтбора = Новый Структура("Ссылка", ДокументРаспределения);
	
	СтруктураПараметров = Новый Структура("КлючВарианта, СтруктураОтбора", "Основной", СтруктураОтбора);
	ПользовательскиеНастройки = ПолучитьПользовательскиеНастройки("ОтчетПоРаспределению", СтруктураПараметров);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",   Ложь);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("КлючВарианта", "Основной");
	
	ОткрытьФорму("Отчет.ОтчетПоРаспределению.Форма", ПараметрыФормы);
	
КонецПроцедуры
