
// Получить таблицу .
//
Функция ПолучитьТаблицуОбъектыВСоставеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОбъектовОСКомплектующие.Количество > 0
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения,
	               |	КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство КАК ИдентификаторКомпьютера,
	               |	КомплектацияОбъектовОСКомплектующие.Объект КАК ОбъектКомпьютера,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОбъектовОСКомплектующие.Количество > 0
	               |			ТОГДА КомплектацияОбъектовОСКомплектующие.Количество
	               |		ИНАЧЕ КомплектацияОбъектовОСКомплектующие.Количество * -1
	               |	КОНЕЦ КАК Количество,
	               |	КомплектацияОбъектовОСКомплектующие.Объект.ШаблонСоответствия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	КомплектацияОбъектовОСКомплектующие.Объект.ШаблонСоответствия.ИдентификаторПрограммы.ПризнакУчета КАК ПризнакУчета,
	               |	МестонахождениеОССрезПоследних.Организация,
	               |	МестонахождениеОССрезПоследних.ПодразделениеОрганизации,
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка.ИдентификаторДомена
	               |ИЗ
	               |	Документ.КомплектацияОбъектовОС.Комплектующие КАК КомплектацияОбъектовОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОбъектовОС.ОсновныеСредства КАК КомплектацияОбъектовОСОсновныеСредства
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(
	               |					&МоментВремени,
	               |					ОсновноеСредство В
	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |							КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство
	               |						ИЗ
	               |							Документ.КомплектацияОбъектовОС.ОсновныеСредства КАК КомплектацияОбъектовОСОсновныеСредства
	               |						ГДЕ
	               |							КомплектацияОбъектовОСОсновныеСредства.Ссылка = &Ссылка)) КАК МестонахождениеОССрезПоследних
	               |			ПО КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |		ПО КомплектацияОбъектовОСКомплектующие.КлючСвязи = КомплектацияОбъектовОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОбъектовОСКомплектующие.Ссылка = КомплектацияОбъектовОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", ДополнительныеСвойства.ДляПроведения.Дата);
	Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()
