////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ...
// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...
// СтандартныеПодсистемы.Свойства
&НаСервере
 Процедура ОбновитьЭлементыДополнительныхРеквизитов()
   УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
 КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, , "ГруппаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ОпределитьДоступнность(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(
		Объект.Ссылка, 
		Неопределено, 
		Элементы.ТекстДокументПоступления,
		Объект.ВидОсновногоСредства <> Справочники.ВидыОсновногоСредства.Лицензия // НеТребуется
	);
	
	ПараметрыОпций = Новый Структура("ВидОсновногоСредства", Объект.ВидОсновногоСредства);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
 Процедура ВидОсновногоСредстваПриИзменении(Элемент)
	 
	 ОбновитьЭлементыДополнительныхРеквизитов();
	 
	 ПараметрыОпций = Новый Структура("ВидОсновногоСредства", Объект.ВидОсновногоСредства);
	 УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);
	 
	 ОпределитьДоступнность(ЭтаФорма);
   
 КонецПроцедуры

&НаКлиенте
// Функция возвращает документ поступления для справочника ОсновныеСредства.
//
// Параметры:
//	Объект           			- ДанныеФормыСтруктура - Данные документа
//	Форма            			- Форма документа
//	Организация      			- СправочникСсылка.Организации - Организация, для которой формируется документ поступления
//	ТекстДокументПоступления 	- Строка - Текст, указанный в поле счет-фактура
//	Поле - ПолеФормы 			- Поле формы для документа поступления
//	НеТребуется      			- Булево - Истина - для справочника не требуется вводить документ поступления
//
Функция ВвестиДокументПоступления(Объект, Форма, Организация, ТекстДокументПоступления, Поле = Неопределено, НеТребуется = Ложь) Экспорт
	
	ДокументПоступления = Неопределено;
	Гиперссылка = Истина;
	ВводитьДокументПоступления = Не НеТребуется;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка, ДокументПоступления);
	КонецЕсли;
	
	НовыйТекстДокументПоступления = "";
	Если Не ЗначениеЗаполнено(ДокументПоступления)
		И ВводитьДокументПоступления Тогда
		
		СтруктураОснование = Новый Структура("ОсновноеСредство", Объект.Ссылка);
		
		НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Основание", СтруктураОснование));
		Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
			НовыйТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ДокументПоступления) Тогда
			НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Ключ", ДокументПоступления));
			Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
				НовыйТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
		ТекстДокументПоступления = НовыйТекстДокументПоступления;
	КонецЕсли;
	
	Если Поле <> Неопределено Тогда
		Если Поле.Гиперссылка <> Гиперссылка Тогда
			Поле.Гиперссылка = Гиперссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстДокументПоступления;
	
КонецФункции // ВвестиДокументПоступления

&НаКлиенте
 Процедура ТекстДокументПоступленияНажатие(Элемент, СтандартнаяОбработка)
	 
	СтандартнаяОбработка = Ложь;
	
	//ТекстДокументПоступления = ЗаполнениеДокументовСервер.ВвестиДокументПоступления(
	ТекстДокументПоступления = ВвестиДокументПоступления(
		Объект,
		ЭтаФорма,
		//Объект.Организация,
		Неопределено,
		ТекстДокументПоступления
	);
	 
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьДоступнность(Форма)

	ДоступностьРеквизитовПерсональныйКомпьютер = Форма.Объект.ВидОсновногоСредства = ПредопределенноеЗначение("Справочник.ВидыОсновногоСредства.ПерсональныйКомпьютер");
	Форма.Элементы.Отключен.Доступность  = ДоступностьРеквизитовПерсональныйКомпьютер;

КонецПроцедуры


