//////////////////////////////////////////////////////////////////////////////// 
// Переменные
// 

&НаКлиенте
Перем АдресЛицензийВХранилище;


&НаСервере
Процедура ЗаполнитьСтоимостьНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьОсновныеСредстваСтоимостью(Объект, Истина, Ложь);	
	
КонецПроцедуры

// Функция помещает список товаров во временное хранилище и возвращает адрес 
&НаСервере
Функция ПоместитьЛицензииВХранилище() 
	Возврат ПоместитьВоВременноеХранилище(Объект.ОсновныеСредства.Выгрузить(,"ОсновноеСредство, Количество, Стоимость"), УникальныйИдентификатор);
КонецФункции

// Функция восстанавливает список товаров из временного хранилища
&НаСервере
Процедура ПолучитьЛицензииИзХранилища(АдресЛицензийВХранилище)
	Объект.ОсновныеСредства.Загрузить(ПолучитьИзВременногоХранилища(АдресЛицензийВХранилище));
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСтоимость(Команда)
	ЗаполнитьСтоимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	АдресЛицензийВХранилище = ПоместитьЛицензииВХранилище();
	ПараметрыПодбора = Новый Структура("АдресЛицензийДокумента, Организация, Контрагент", АдресЛицензийВХранилище, Объект.Организация, Объект.Контрагент);
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ФормаПодбора = ОткрытьФорму("Документ.ПоступлениеОС.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПодбор() Экспорт
	
	ПолучитьЛицензииИзХранилища(АдресЛицензийВХранилище);  
	
КонецПроцедуры
