//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//       

// Процедура помещает результаты подбора в хранилище
&НаСервере
Процедура ЗаписатьПодборВХранилище() 
	ПоместитьВоВременноеХранилище(ОсновныеСредства.Выгрузить(), АдресЛицензийДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛицензию(Лицензия)
	Строки = ОсновныеСредства.НайтиСтроки(Новый Структура("ОсновноеСредство", Лицензия));
	Если Строки.Количество() > 0 Тогда
		Элемент = Строки[0];
		Элемент.Количество = Строки[0].Количество + 1;
	Иначе 
		Элемент = ОсновныеСредства.Добавить();
		Элемент.ОсновноеСредство = Лицензия;
		Элемент.Количество = 1;
	КонецЕсли;	
	
	Элементы.ОсновныеСредства.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЛицензийДокумента = Параметры.АдресЛицензийДокумента;
	ОсновныеСредства.Загрузить(ПолучитьИзВременногоХранилища(АдресЛицензийДокумента));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛицензийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДобавитьЛицензию(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьПодбор();
	Закрыть();
	
КонецПроцедуры
