////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НедоступныеВидыДоступа = Новый СписокЗначений;
	НеиспользуемыеВидыДоступа  = Новый СписокЗначений;
	
	Для каждого СвойстваВидаДоступа Из УправлениеДоступомСлужебный.СвойстваВидаДоступа() Цикл
		
		Если СвойстваВидаДоступа.ВидДоступаИспользуетсяВсегда Тогда
			// Технологические виды доступа всегда недоступны.
			НедоступныеВидыДоступа.Добавить(СвойстваВидаДоступа.ВидДоступа);
			
		ИначеЕсли НЕ УправлениеДоступомСлужебный.ВидДоступаИспользуется(СвойстваВидаДоступа.ВидДоступа) Тогда
			Если НЕ Параметры.Свойство("ПоказыватьНеиспользуемыеВидыДоступа") Тогда
				НедоступныеВидыДоступа.Добавить(СвойстваВидаДоступа.ВидДоступа);
			КонецЕсли;
			НеиспользуемыеВидыДоступа.Добавить(СвойстваВидаДоступа.ВидДоступа);
		КонецЕсли;
	КонецЦикла;
	
	// Скрытие недоступных видов доступа.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Ссылка", НедоступныеВидыДоступа, , , Истина);
	
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение = НеиспользуемыеВидыДоступа;
	
КонецПроцедуры
