////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа().
//
//  ПараметрыОбновления - Структура со свойствами:
//
//                        ОбновлятьИзмененныеПрофили - Булево (начальное значение Истина).
//
//                        ЗапретитьИзменениеПрофилей - Булево (начальное значение Истина),
//                        если установить Ложь, тогда поставляемые профили будут открываться
//                        в режиме ТолькоПросмотр.
//
//                        ОбновлятьГруппыДоступа - Булево (начальное значение Истина).
//
//                        ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево (начальное
//                        значение Ложь), если установить Истина, то настройки значений,
//                        сделанные администратором по виду доступа, который удален из
//                        профиля, будут удалены из группы доступа.
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	//// _Демо начало примера
	//
	//ПараметрыОбновления.ОбновлятьИзмененныеПрофили = Ложь;
	//ПараметрыОбновления.ЗапретитьИзменениеПрофилей = Ложь;
	//
	//// Профиль "Пользователь".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "Пользователь";
	//ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9ad2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Общие разрешенные действия для большинства пользователей.
	//			   |Как правило, это права на просмотр данных информационной системы.'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭЦП");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнформационногоЦентра");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗаметок");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеНапоминаний");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеПроектов");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоРазделБизнесПроцессыИЗадачи");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеЗаданийСРолевойАдресацией");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ПапкиФайлов", "Предустановленный");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПокупатели");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПоставщики");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Бухгалтер".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "Бухгалтер";
	//ОписаниеПрофиля.Идентификатор = "75fa0eca-98aa-11df-b54f-e0cb4ed5f655";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Демонстрирует использование
	//			   |- предустановленных видов доступа. Например, в отличие от профиля ""Руководитель""
	//			   |бухгалтерам разрешено редактировать документы ""Демо: Расходный кассовый ордер"" с типом
	//			   |хозяйственной операции - ""Выдача денежных средств подотчет"".
	//			   |- изменение как правило недоступных свойств объекта (на примере персональных данных физического лица).'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеКассовыхДокументов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения",         "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",                "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПокупатели",    "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПоставщики",    "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоХозяйственныеОперации", "Предустановленный");
	//ОписаниеПрофиля.ЗначенияДоступа.Добавить("_ДемоХозяйственныеОперации", "Перечисление._ДемоХозяйственныеОперации.ВыдачаДенежныхСредствПодотчет");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Расчетчик зарплаты".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "РасчетчикЗарплаты";
	//ОписаниеПрофиля.Идентификатор = "11851213-0f5f-11e0-96c1-e0cb4ed5f655";
	//ОписаниеПрофиля.Наименование  = "Расчетчик зарплаты";
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеЗарплаты");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоФизическиеЛица");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Менеджер".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "Менеджер";
	//ОписаниеПрофиля.Идентификатор = "c7e34f11-9890-11df-b54f-e0cb4ed5f655";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Предназначен для настройки групп доступа, демонстрирующих
	//			   |работу пользователей по вводу и изменению данных различных подсистем в разрезе различных
	//			   |видов доступа. В частности:
	//			   |- проведение и анализ результатов опросов (подсистема ""Анкетирование"");
	//			   |- ведение дополнительных сведений (подсистема ""Свойства"");
	//			   |- редактирование проектов и их присоединенных файлов (подсистема ""Присоединенные файлы"").
	//			   |
	//			   |Кроме того, в отличие от профилей ""Руководитель"" и ""Бухгалтер"", менеджерам вообще
	//			   |не доступны документы ""Демо: Расходный кассовый ордер"".'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭЦП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеПроектов");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоПечатьСчетаНаОплатуНаПринтер");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновАнкет");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПокупатели");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПоставщики");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Руководитель".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "Руководитель";
	//ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководитель'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Предназначен для создания групп доступа, демонстрирующих
	//			   |использование предустановленных видов доступа. Например, в отличие от профиля ""Бухгалтер""
	//			   |руководителю разрешено редактировать документы ""Демо: Расходный кассовый ордер"" с типом 
	//			   |хозяйственной операции - ""Выдача зарплаты"", а персональные данные физических лиц - только просматривать.'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭЦП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеКассовыхДокументов");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеЗарплаты");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхДляОтветовНаВопросыАнкет");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхОбъектовАвторизации");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхРеспондентов");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеЗаданийСРолевойАдресацией");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоХозяйственныеОперации", "Предустановленный");
	//ОписаниеПрофиля.ЗначенияДоступа.Добавить("_ДемоХозяйственныеОперации", "Перечисление._ДемоХозяйственныеОперации.ВыдачаЗарплаты");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Ответственный за ведение взаимодействий".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеВзаимодействий";
	//ОписаниеПрофиля.Идентификатор = "62e89fcd-9a4c-11df-8c0e-0011d8570cdf";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение взаимодействий'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Ведение взаимодействий с клиентами, поставщиками, партнерами и т.п. по электронной почте и телефону,
	//			   |а также планирование встреч (подсистема ""Взаимодействия"").'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Типовые возможности.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоПартнерыПокупатели", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//
	//// Профиль "Респондент".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "Респондент";
	//ОписаниеПрофиля.Идентификатор = "67b8f689-ee30-11de-a1c1-005056c00008";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Респондент'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Предназначен для внешних пользователей, которые участвуют в опросах
	//			   |(подсистемы ""Анкетирование"" и ""Внешние пользователи"").'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоВнешнегоПользователя");
	//// Использование НСИ.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхДляОтветовНаВопросыАнкет");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхОбъектовАвторизации");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Ответственный за нормативно-справочную информацию".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ОтветственныйЗаНСИ";
	//ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9fe2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за нормативно-справочную информацию'");
	//ОписаниеПрофиля.Описание = НСтр("ru = 'Ведение и обновление классификаторов, различной нормативно-справочной информации.'");
	//// Использование 1С:Предприятия.
	//ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//// Использование программы.
	//ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	//// Изменение НСИ, в том числе и стран мира
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБазовойНСИ");
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеНСИ");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Дополнительные профили, которые не используются самостоятельно при настройке
	//// прав пользователя, а дополняют основные профили, перечисленные выше.
	//
	//// Профиль "Ответственный за составы участников групп доступа (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ОтветственныйЗаСоставыУчастниковГруппДоступа";
	//ОписаниеПрофиля.Идентификатор = "588438ff-e954-11de-8634-001d600d9ad2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за составы участников групп доступа (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Назначается тем пользователям, у которых должна быть
	//			   |возможность изменять состав участников своих групп доступа.'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Ответственный за ведение номенклатуры (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНоменклатуры";
	//ОписаниеПрофиля.Идентификатор = "d348b8f5-1437-11e2-bb53-005056c00008";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение номенклатуры (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Назначается тем пользователям, которые будут добавлять или изменять номенклатуру.'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеНоменклатуры");
	//// Работа с НСИ только в части стран мира
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтранМира");
	//
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры", "ВначалеВсеРазрешены");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Ответственный за список внешних пользователей (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ОтветственныйЗаСписокВнешнихПользователей";
	//ОписаниеПрофиля.Идентификатор = "14401b24-3591-11df-863c-001d600d9ad2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за список внешних пользователей (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
	//			   |доступна возможность добавления и редактирования свойств внешних пользователей
	//			   |(подсистема ""Внешние пользователи"").'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Настройка синхронизации данных (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "НастройкаСинхронизацииДанных";
	//ОписаниеПрофиля.Идентификатор = "04937802-5dba-11df-a1d4-005056c00008";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Настройка синхронизации данных (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
	//			   |доступна настройка синхронизации данных с другими программами
	//			   |(подсистема ""Обмен данными"").'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("НастройкаСинхронизацииДанных");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Использование электронной почты (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ИспользованиеЭлектроннойПочты";
	//ОписаниеПрофиля.Идентификатор = "588438ff-e854-11de-8634-001d600d9ad1";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование электронной почты (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Дополнительно назначается тем пользователям, которым должны быть
	//			   |доступны различные функции получения и отправки электронной почты,
	//			   |имеющиеся в системе.'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Печать непроведенных документов (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "ПечатьНепроведенныхДокументов";
	//ОписаниеПрофиля.Идентификатор = "c944ca49-dfee-11de-8632-001d600d9ad2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Печать непроведенных документов (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
	//			   |доступна печать непроведенных документов.
	//			   |Демонстрирует использование функции ЕстьРоль()
	//			   |с использованием параметра НаборыЗначенийДоступа.'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("_ДемоПечатьНепроведенныхДокументов");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// Профиль "Работа с папками файлов (дополнительно)".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Имя           = "РаботаСПапкамиФайлов";
	//ОписаниеПрофиля.Идентификатор = "a8f63f6c-ced9-11de-862f-001d600d9ad2";
	//ОписаниеПрофиля.Наименование  = НСтр("ru = 'Работа с папками файлов (дополнительно)'");
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = 'Дополнительно назначается тем пользователям, которым разрешено 
	//			   |работать с папками файлов (подсистема ""Работа с файлами"").'");
	//// Основные возможности профиля.
	//ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	//// Виды ограничения доступа профиля.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ПапкиФайлов", "Предустановленный");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//
	//// _Демо конец примера
	
КонецПроцедуры

// Заполняет свойства видов доступа, добавленных прикладным разработчиком
// в план видов характеристик ВидыДоступа, как предопределенные элементы.
//
// Параметры:
//  Свойства - Структура со свойствами,
//             описание которых см. в комментарии к функции
//             ПланыВидовХарактеристик.ВидыДоступа.СвойстваВидовДоступа().
//
Процедура ЗаполнитьСвойстваВидаДоступа(Знач Свойства) Экспорт
	
	//// _Демо начало примера
	//Если Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа._ДемоПартнерыПокупатели Тогда
	//	Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Ложь;
	//	Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
	//	Свойства.Таблицы.Добавить("Справочник._ДемоПартнеры");
	//	
	//ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа._ДемоПартнерыПоставщики Тогда
	//	Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Ложь;
	//	Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
	//	Свойства.Таблицы.Добавить("Справочник._ДемоПартнеры");
	//	
	//ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа._ДемоГруппыНоменклатуры Тогда
	//	Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
	//	Свойства.Таблицы.Добавить("Справочник._ДемоНоменклатура");
	//	Свойства.Таблицы.Добавить("Справочник._ДемоВидыНоменклатуры");
	//	
	//ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа._ДемоМестаХранения Тогда
	//	Свойства.Таблицы.Добавить("Справочник._ДемоМестаХранения");
	//	
	//КонецЕсли;
	//// _Демо конец примера
	
КонецПроцедуры

// Заполняет использование видов доступа, добавленных прикладным разработчиком
// в план видов характеристик ВидыДоступа, как предопределенные элементы.
//
// Параметры:
//  ВидДоступа    - ПланВидовХарактеристикСсылка.ВидыДоступа.
//  Использование - Булево (возвращаемое значение). Начальное значение Истина.
// 
Процедура ЗаполнитьИспользованиеВидаДоступа(Знач ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых по значениям доступа.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений, содержащая поля,
//                   описание которых  см. в комментарии к функции
//                   РегистрыСведений.ПраваПоЗначениямДоступа.ВозможныеПрава().
//
Процедура ЗаполнитьВозможныеПраваПоЗначениямДоступа(Знач ВозможныеПрава) Экспорт
	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Знач Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	// _Демо начало примера
	ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
	
	Если ПолноеИмя = "Справочник.Файлы"
	 ИЛИ ПолноеИмя = "Документ._ДемоЗаказПокупателя" Тогда
		// Зависимые типы объектов:
		
		//  БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаданиеСРолевойАдресацией.Ссылка
		|ИЗ
		|	БизнесПроцесс.ЗаданиеСРолевойАдресацией КАК ЗаданиеСРолевойАдресацией
		|ГДЕ
		|	ЗаданиеСРолевойАдресацией.Предмет = &Предмет");
		Запрос.УстановитьПараметр("Предмет", Ссылка);
		СсылкиНаЗависимыеОбъекты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	// _Демо конец примера
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Параметры:
//  Таблица      - РегистрСведенийНаборЗаписей.ЗависимостиПравДоступа.
//                 Допустимые значения ресурсов:
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоЧтения",
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоДобавления",
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоИзменения".
//
//                 Если задано недопустимое значение, будет установлено значение по умолчанию:
//                 для права Чтение                         - ПланыВидовХарактеристик.ВидыДоступа.ПравоЧтения,
//                 для прав Добавление, Изменение, Удаление - ПланыВидовХарактеристик.ВидыДоступа.ПравоИзменения.
//                 
//                 Следует иметь в виду, что обычная "жесткость" условия ограничения доступа
//                 уменьшается в порядке "Добавление", "Изменение", "Чтение",
//                 Т.е. то, что можно добавить, можно и изменить и прочитать,
//                 соответственно, то что можно изменить можно и прочитать, но не наоборот.
//
Процедура ЗаполнитьЗависимостиПравДоступа(Знач Таблица) Экспорт
	
	// _Демо начало примера
	
	// То же для бизнес-процесса "Демо: Задание с ролевой адресацией".
	Строка = Таблица.Добавить();
	Строка.ПодчиненнаяТаблица = "Задача.ЗадачаИсполнителя";
	Строка.ТипВедущейТаблицы  = БизнесПроцессы.ЗаданиеСРолевойАдресацией.ПустаяСсылка();
	
	// _Демо конец примера
	
КонецПроцедуры

// Возвращает вид используемого интерфейса для настройки прав доступа.
//
//  Упрощенный интерфейс удобен для конфигураций с небольшим количеством пользователей,
// так как много функций не требуются и они могут быть скрыты (скрытие не может быть
// выполнено только лишь функциональной опцией, так как потребуется пересмотр
// содержимого групп доступа и профилей).
//
// Возвращаемое значение:
//  Булево
//
Функция УпрощенныйИнтерфейсНастройкиПравДоступа() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые
// в шаблонах ограничения доступа явно, а виды доступа, используемые
// в наборах значений доступа могут быть получены из текущего состояния
// регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
// Параметры:
//  Описание     - Строка, многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта]
//                 Например, Документ.ПриходнаяНакладная.Чтение.Организации
//                           Документ.ПриходнаяНакладная.Чтение.Контрагенты
//                           Документ.ПриходнаяНакладная.Добавление.Организации
//                           Документ.ПриходнаяНакладная.Добавление.Контрагенты
//                           Документ.ПриходнаяНакладная.Изменение.Организации
//                           Документ.ПриходнаяНакладная.Изменение.Контрагенты
//                           Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Добавление.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Добавление.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Добавление.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо
//                 Вид доступа Объект предопределен, как литерал, его нет в предопределенных элементах
//                 ПланыВидовХарактеристик.ВидыДоступа. Этот вид доступа используется в шаблонах ограничений доступа,
//                 как "ссылка" на другой объект, по которому ограничивается таблица.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц, которые используются
//                 для этого вида доступа. Т.е. перечислить типы, которые соответствующие полю,
//                 использованному в шаблоне ограничения доступа в паре с видом доступа "Объект".
//                 При перечислении типов по виду доступа "Объект" нужно перечислить только те типы поля,
//                 которые есть у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ЗаполнитьВидыОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	// _Демо начало примера
	
	// _ДемоБизнесПроцессыИЗадачи
	Описание = Описание + 
	"
	|БизнесПроцесс.ЗаданиеСРолевойАдресацией.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|БизнесПроцесс.ЗаданиеСРолевойАдресацией.Добавление.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|БизнесПроцесс.ЗаданиеСРолевойАдресацией.Изменение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|";
	
	// _ДемоРаботаСФайлами
	Описание = Описание + 
	"
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник._ДемоПартнеры
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|Справочник.Файлы.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.Файлы.Чтение.Объект.Справочник._ДемоПартнеры
	|Справочник.Файлы.Добавление.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|Справочник.Файлы.Добавление.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.Файлы.Добавление.Объект.Справочник._ДемоПартнеры
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|Справочник.Файлы.Изменение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.Файлы.Изменение.Объект.Справочник._ДемоПартнеры
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.БизнесПроцесс.ЗаданиеСРолевойАдресацией
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник._ДемоПартнеры
	|";
	
	// _ДемоУправлениеДоступом
	Описание = Описание + 
	"
	|Справочник._ДемоГруппыДоступаПартнеров.Чтение._ДемоПартнерыПокупатели
	|Справочник._ДемоГруппыДоступаПартнеров.Чтение._ДемоПартнерыПоставщики
	|";
	
	
	// Другие демо-объекты.
	Описание = Описание + 
	"
	|Справочник._ДемоМестаХранения.Чтение._ДемоМестаХранения
	|Справочник._ДемоПартнеры.Чтение._ДемоПартнерыПокупатели
	|Справочник._ДемоПартнеры.Чтение._ДемоПартнерыПоставщики
	|Справочник._ДемоПроекты.Чтение.Организации
	|Справочник._ДемоПроекты.Добавление.Организации
	|Справочник._ДемоПроекты.Изменение.Организации
	|Справочник._ДемоПроектыПрисоединенныеФайлы.Чтение.Организации
	|Справочник._ДемоПроектыПрисоединенныеФайлы.Добавление.Организации
	|Справочник._ДемоПроектыПрисоединенныеФайлы.Изменение.Организации
	|Документ._ДемоНачислениеЗарплаты.Чтение.Объект.Документ._ДемоНачислениеЗарплаты
	|Документ._ДемоНачислениеЗарплаты.Добавление.Объект.Документ._ДемоНачислениеЗарплаты
	|Документ._ДемоНачислениеЗарплаты.Изменение.Объект.Документ._ДемоНачислениеЗарплаты
	|Документ._ДемоЗаказПокупателя.Чтение.Организации
	|Документ._ДемоЗаказПокупателя.Чтение._ДемоПартнерыПокупатели
	|Документ._ДемоЗаказПокупателя.Добавление.Организации
	|Документ._ДемоЗаказПокупателя.Добавление._ДемоПартнерыПокупатели
	|Документ._ДемоЗаказПокупателя.Изменение.Организации
	|Документ._ДемоЗаказПокупателя.Изменение._ДемоПартнерыПокупатели
	|Документ._ДемоОприходованиеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоОприходованиеТоваров.Чтение.Организации
	|Документ._ДемоОприходованиеТоваров.Добавление._ДемоМестаХранения
	|Документ._ДемоОприходованиеТоваров.Добавление.Организации
	|Документ._ДемоОприходованиеТоваров.Добавление.Пользователи
	|Документ._ДемоОприходованиеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоОприходованиеТоваров.Изменение.Организации
	|Документ._ДемоОприходованиеТоваров.Изменение.Пользователи
	|Документ._ДемоПеремещениеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоПеремещениеТоваров.Чтение.Организации
	|Документ._ДемоПеремещениеТоваров.Добавление._ДемоМестаХранения
	|Документ._ДемоПеремещениеТоваров.Добавление.Организации
	|Документ._ДемоПеремещениеТоваров.Добавление.Пользователи
	|Документ._ДемоПеремещениеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоПеремещениеТоваров.Изменение.Организации
	|Документ._ДемоПеремещениеТоваров.Изменение.Пользователи
	|Документ._ДемоРасходныйКассовыйОрдер.Чтение.Организации
	|Документ._ДемоРасходныйКассовыйОрдер.Чтение._ДемоХозяйственныеОперации
	|Документ._ДемоРасходныйКассовыйОрдер.Добавление.Организации
	|Документ._ДемоРасходныйКассовыйОрдер.Добавление._ДемоХозяйственныеОперации
	|Документ._ДемоРасходныйКассовыйОрдер.Изменение.Организации
	|Документ._ДемоРасходныйКассовыйОрдер.Изменение._ДемоХозяйственныеОперации
	|Документ._ДемоСписаниеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоСписаниеТоваров.Чтение.Организации
	|Документ._ДемоСписаниеТоваров.Добавление._ДемоМестаХранения
	|Документ._ДемоСписаниеТоваров.Добавление.Организации
	|Документ._ДемоСписаниеТоваров.Добавление.Пользователи
	|Документ._ДемоСписаниеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоСписаниеТоваров.Изменение.Организации
	|Документ._ДемоСписаниеТоваров.Изменение.Пользователи
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоОприходованиеТоваров
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоПеремещениеТоваров
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоСписаниеТоваров
	|РегистрНакопления._ДемоОстаткиТоваровВМестахХранения.Чтение._ДемоМестаХранения
	|РегистрНакопления._ДемоОстаткиТоваровВМестахХранения.Чтение.Организации
	|";
	
	// _Демо конец примера
	
КонецПроцедуры
