
// Получить таблицу .
//
Функция ПолучитьТаблицуКоличественныйУчетОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство КАК ОсновноеСредство,
	               |	КомплектацияОСКомплектующие.Количество
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
	               |	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК МОЛ,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.ПустаяСсылка) КАК Помещение,
	               |	КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОСВладелец
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОС.ОсновныеСредства КАК КомплектацияОСОсновныеСредства
	               |		ПО КомплектацияОСКомплектующие.КлючСвязи = КомплектацияОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОСКомплектующие.Ссылка = КомплектацияОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

// Получить таблицу .
//
Функция ПолучитьТаблицуКомплектующиеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОСКомплектующие.Количество > 0
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения,
	               |	КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство КАК Комплектующая,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОСКомплектующие.Количество > 0
	               |			ТОГДА КомплектацияОСКомплектующие.Количество
	               |		ИНАЧЕ КомплектацияОСКомплектующие.Количество * -1
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОС.ОсновныеСредства КАК КомплектацияОСОсновныеСредства
	               |		ПО КомплектацияОСКомплектующие.КлючСвязи = КомплектацияОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОСКомплектующие.Ссылка = КомплектацияОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()
