////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление версии ИБ"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается при нажатии на гиперссылку или двойном щелчке на ячейке 
// табличного документа с описанием изменений системы.
//
// Параметры:
//   Область - ОбластьЯчеекТабличногоДокумента - область документа, на 
//             которой произошло нажатие.
//
// См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(Знач Область) Экспорт
	
	//// _Демо начало примера   										//Комиссаров: 05/08/2013
	//Если Область.Имя = "_ДемоПримерГиперссылки" Тогда
	//	Предупреждение(НСтр("ru = 'Нажата гиперссылка.'"));
	//КонецЕсли;
	//
	//Если Область.Имя = "_ДемоОбновитьДанныеОграниченияДоступа" Тогда
	//	Если ПолучитьФункциональнуюОпциюИнтерфейса("ОграничиватьДоступНаУровнеЗаписей") Тогда
	//		ОткрытьФорму("Справочник.ГруппыДоступа.Форма.ОбновлениеДанныхОграниченияДоступа");
	//	Иначе
	//		Предупреждение(НСтр("ru = 'Ограничение доступа на уровне записей не используется.'"));
	//	КонецЕсли;
	//КонецЕсли;
	//// _Демо конец примера
	
КонецПроцедуры
