//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//       

// Процедура помещает результаты подбора в хранилище
&НаСервере
Процедура ЗаписатьПодборВХранилище() 
	ПоместитьВоВременноеХранилище(ОсновныеСредства.Выгрузить(), АдресЛицензийДокумента);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация	= Параметры.Организация;
	ИдентификаторПрограммы = Параметры.ИдентификаторПрограммы;
	АдресЛицензийДокумента = Параметры.АдресЛицензийДокумента;
	ОсновныеСредства.Загрузить(ПолучитьИзВременногоХранилища(АдресЛицензийДокумента));
	
	Действие = "Установить лицензию по значению";
	
	//Установим вариант значения по умолчанию
	Для каждого Строка Из ОсновныеСредства Цикл
		Если ЗначениеЗаполнено(Строка.Лицензия) Тогда
			ВариантЗначения = Строка.Лицензия;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьПодбор();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьИзменение(Команда)
	
	Если ЗначениеЗаполнено(ВариантЗначения) И Действие = "Установить лицензию по значению" Тогда
	
		Для каждого Строка Из ОсновныеСредства Цикл
		
			Если Строка.Флаг Тогда
				
				Строка.Лицензия = ВариантЗначения;
				
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЕсли;		
			
КонецПроцедуры

&НаСервере
Процедура УстановитьТипВариантаЗначения()
	
	//ДоступныеОрганизации.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	
КонецПроцедуры	

&НаКлиенте
Процедура ДействиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Установить лицензию по значению");
	
	ЭлементСписка = ВыбратьИзСписка(СписокВыбора, Элементы.Действие, 1);
	Если ЭлементСписка <> Неопределено Тогда
		Действие = ЭлементСписка.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ИдентификаторПрограммы", ИдентификаторПрограммы);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаСпискаСОстатками", ПараметрыФормы, Элементы.ВариантЗначения, УникальныйИдентификатор);
		
КонецПроцедуры
