
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	
	
	Если Параметры.Свойство("Организация") И Параметры.Отбор.Свойство("ИдентификаторПрограммы") Тогда
	
		СтандартнаяОбработка = Ложь;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СправочникОсновныеСредства.Ссылка КАК Лицензия,
		|	СправочникОсновныеСредства.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
		|	ЛицензииОрганизацииОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	Справочник.ОсновныеСредства КАК СправочникОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛицензииОрганизации.Остатки(, Организация = &Организация) КАК ЛицензииОрганизацииОстатки
		|		ПО СправочникОсновныеСредства.ИдентификаторПрограммы = ЛицензииОрганизацииОстатки.ИдентификаторПрограммы
		|			И СправочникОсновныеСредства.Ссылка = ЛицензииОрганизацииОстатки.Лицензия
		|ГДЕ
		|	СправочникОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.Лицензия)
		|	И НЕ ЛицензииОрганизацииОстатки.КоличествоОстаток ЕСТЬ NULL 
		|	И НЕ СправочникОсновныеСредства.ЭтоГруппа
		|	И СправочникОсновныеСредства.ИдентификаторПрограммы В(&СписокИдентификаторов)
		|	И СправочникОсновныеСредства.Наименование ПОДОБНО &СтрокаПоиска";
		
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("СписокИдентификаторов", УправлениеОсновнымиСредствамиСервер.ВернутьИдентификаторыАналогаНаСервере(Параметры.Отбор.ИдентификаторПрограммы));
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Список = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			
			Список.Добавить(Выборка.Лицензия);	
			
		КонецЦикла; 
		
		ДанныеВыбора = Список;
	
	КонецЕсли; 
	
	
КонецПроцедуры //ОбработкаПолученияДанныхВыбора
