//Процедура ЗаполнитьОстатки1() Экспорт
//	
//	
//	//Заполнение таблицы остатков
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				   |	РазмещениеОбъектов.ИдентификаторПрограммы КАК Идентификатор,
//				   |	ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, 0) КАК Закуплено,
//				   |	ЕСТЬNULL(РазмещениеЛицензийОстатки.КоличествоОстаток, 0) КАК Размещено,
//				   |	РазмещениеОбъектов.Установлено,
//				   |	ЕСТЬNULL(ЛицензииОрганизацииОстатки.КоличествоОстаток, 0) КАК Свободно
//				   |ИЗ
//				   |	(ВЫБРАТЬ
//				   |		РазмещеноОбъектов.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
//				   |		СУММА(РазмещеноОбъектов.Установлено) КАК Установлено
//				   |	ИЗ
//				   |		(ВЫБРАТЬ
//				   |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
//				   |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
//				   |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК Установлено
//				   |		ИЗ
//				   |			РегистрНакопления.РазмещениеОбъектов.Остатки(
//				   |					,
//				   |					(&ПоВсемОрганизациям
//				   |						ИЛИ Организация = &Организация)
//				   |						И ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеОбъектовОстатки
//				   |		
//				   |		СГРУППИРОВАТЬ ПО
//				   |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы,
//				   |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера) КАК РазмещеноОбъектов
//				   |	
//				   |	СГРУППИРОВАТЬ ПО
//				   |		РазмещеноОбъектов.ИдентификаторПрограммы) КАК РазмещениеОбъектов
//				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты(
//				   |				,
//				   |				,
//				   |				,
//				   |				(&ПоВсемОрганизациям
//				   |					ИЛИ Организация = &Организация)
//				   |					И ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК ЗакупкиОбороты
//				   |		ПО РазмещениеОбъектов.ИдентификаторПрограммы = ЗакупкиОбороты.ИдентификаторПрограммы
//				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЛицензий.Остатки(
//				   |				,
//				   |				(&ПоВсемОрганизациям
//				   |					ИЛИ Организация = &Организация)
//				   |					И ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеЛицензийОстатки
//				   |		ПО РазмещениеОбъектов.ИдентификаторПрограммы = РазмещениеЛицензийОстатки.ИдентификаторПрограммы
//				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛицензииОрганизации.Остатки(
//				   |				,
//				   |				(&ПоВсемОрганизациям
//				   |					ИЛИ Организация = &Организация)
//				   |					И ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК ЛицензииОрганизацииОстатки
//				   |		ПО РазмещениеОбъектов.ИдентификаторПрограммы = ЛицензииОрганизацииОстатки.ИдентификаторПрограммы
//				   |
//				   |УПОРЯДОЧИТЬ ПО
//				   |	Идентификатор";
//				   
//	Запрос.УстановитьПараметр("Организация", Организация);
//	//Запрос.УстановитьПараметр("ПоВсемОрганизациям", ПоВсемОрганизациям);
//	
//	Результат = Запрос.Выполнить().Выгрузить();
//	
//	//Объект.ТаблицаОстатков.Загрузить(Результат);
//	
//	
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = "ВЫБРАТЬ
//	//			   |	РазмещениеЛицензийОстатки.ИдентификаторКомпьютера КАК Идентификатор,
//	//			   |	РазмещениеЛицензийОстатки.ПодразделениеОрганизации КАК Подразделение,
//	//			   |	МестонахождениеОССрезПоследних.МОЛ КАК Пользователь,
//	//			   |	РазмещениеЛицензийОстатки.Лицензия,
//	//			   |	РазмещениеЛицензийОстатки.КоличествоОстаток КАК Количество,
//	//			   |	ИСТИНА КАК Установлен
//	//			   |ИЗ
//	//			   |	РегистрНакопления.РазмещениеЛицензий.Остатки(
//	//			   |			,
//	//			   |			Организация = &Организация
//	//			   |				И ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеЛицензийОстатки
//	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(, Организация = &Организация) КАК МестонахождениеОССрезПоследних
//	//			   |		ПО РазмещениеЛицензийОстатки.ИдентификаторКомпьютера = МестонахождениеОССрезПоследних.ОсновноеСредство";
//	//			   
//	//Запрос.УстановитьПараметр("Организация", Организация);
//	//			   
//	//Таблица = Запрос.Выполнить().Выгрузить();			   
//	
//	
//	
//КонецПроцедуры //ЗаполнитьОстатки

//Процедура ЗаполнитьТаблицы() Экспорт
//	
//	
//КонецПроцедуры 	