Функция ЗаполнитьМертвыйСофт() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазмещеноЛицензии.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |	РазмещеноЛицензии.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |	ЕСТЬNULL(УстановленоОбъектов.КоличествоУстановлено, 0) КАК КоличествоУстановлено,
	               |	ИСТИНА КАК Флаг,
	               |	РазмещеноЛицензии.Организация,
	               |	РазмещеноЛицензии.ПодразделениеОрганизации,
	               |	РазмещеноЛицензии.Лицензия,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	РазмещеноЛицензии.Лицензия.ИдентификаторПрограммы КАК ЛицензияИдентификаторПрограммы,
	               |	РазмещеноЛицензии.Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация КАК Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия КАК Лицензия,
	               |		СУММА(РазмещениеЛицензийОстатки.КоличествоОстаток) КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеЛицензий.Остатки(
	               |				,
	               |				ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |					И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаРабочееМесто)) КАК РазмещениеЛицензийОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия) КАК РазмещеноЛицензии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК КоличествоУстановлено
	               |		ИЗ
	               |			РегистрНакопления.РазмещениеОбъектов.Остатки(
	               |					,
	               |					ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |						И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаРабочееМесто)) КАК РазмещениеОбъектовОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК УстановленоОбъектов
	               |		ПО РазмещеноЛицензии.ИдентификаторКомпьютера = УстановленоОбъектов.ИдентификаторКомпьютера
	               |			И РазмещеноЛицензии.ИдентификаторУстановлено = УстановленоОбъектов.ИдентификаторПрограммы
	               |ГДЕ
	               |	УстановленоОбъектов.КоличествоУстановлено ЕСТЬ NULL 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РазмещеноЛицензии.ИдентификаторКомпьютера,
	               |	РазмещеноЛицензии.ИдентификаторУстановлено,
	               |	ЕСТЬNULL(УстановленоОбъектов.КоличествоУстановлено, 0),
	               |	ИСТИНА,
	               |	РазмещеноЛицензии.Организация,
	               |	РазмещеноЛицензии.ПодразделениеОрганизации,
	               |	РазмещеноЛицензии.Лицензия,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Расход),
	               |	РазмещеноЛицензии.Лицензия.ИдентификаторПрограммы,
	               |	РазмещеноЛицензии.Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация КАК Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия КАК Лицензия,
	               |		СУММА(РазмещениеЛицензийОстатки.КоличествоОстаток) КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеЛицензий.Остатки(
	               |				,
	               |				ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |					И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаОрганизацию)) КАК РазмещениеЛицензийОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия) КАК РазмещеноЛицензии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КомпьютерыОрганизации.Организация КАК Организация,
	               |			ОбязательныйСофтОрганизаций.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			КомпьютерыОрганизации.ОсновноеСредство КАК ИдентификаторКомпьютера,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КомпьютерыОрганизации.ОсновноеСредство) КАК КоличествоУстановлено
	               |		ИЗ
	               |			РегистрСведений.ОбязательныйСофтОрганизаций КАК ОбязательныйСофтОрганизаций
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(, ) КАК КомпьютерыОрганизации
	               |				ПО ОбязательныйСофтОрганизаций.Организация = КомпьютерыОрганизации.Организация
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КомпьютерыОрганизации.Организация,
	               |			ОбязательныйСофтОрганизаций.ИдентификаторПрограммы,
	               |			КомпьютерыОрганизации.ОсновноеСредство) КАК УстановленоОбъектов
	               |		ПО РазмещеноЛицензии.ИдентификаторКомпьютера = УстановленоОбъектов.ИдентификаторКомпьютера
	               |			И РазмещеноЛицензии.ИдентификаторУстановлено = УстановленоОбъектов.ИдентификаторПрограммы
	               |			И РазмещеноЛицензии.Организация = УстановленоОбъектов.Организация
	               |ГДЕ
	               |	УстановленоОбъектов.КоличествоУстановлено ЕСТЬ NULL 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИдентификаторКомпьютера";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ЗаполнитьЖивойСофт() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛОЖЬ КАК Флаг,
	               |	РазмещениеОбъектов.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |	РазмещениеОбъектов.ИдентификаторПрограммы КАК ИдентификаторУстановлено,
	               |	РазмещениеОбъектов.КоличествоУстановлено КАК Количество,
	               |	ЕСТЬNULL(РазмещениеЛицензийОстатки.КоличествоОстаток, 0) КАК КоличествоУстановлено,
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.ПодразделениеОрганизации, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ПодразделениеОрганизации
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеОбъектовОстатки.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК КоличествоУстановлено
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеОбъектов.Остатки(, ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеОбъектовОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК РазмещениеОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЛицензий.Остатки(, ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеЛицензийОстатки
	               |		ПО РазмещениеОбъектов.ИдентификаторКомпьютера = РазмещениеЛицензийОстатки.ИдентификаторКомпьютера
	               |			И РазмещениеОбъектов.ИдентификаторПрограммы = РазмещениеЛицензийОстатки.ИдентификаторУстановлено
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОССрезПоследних
	               |		ПО РазмещениеОбъектов.ИдентификаторКомпьютера = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |ГДЕ
	               |	РазмещениеЛицензийОстатки.КоличествоОстаток ЕСТЬ NULL 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИдентификаторКомпьютера";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ЗаполнитьЖивойСофт	