&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
//// <Описание процедуры>
////
//// Параметры
////  <Параметр1>  - <Тип.Вид> - <описание параметра>
////                 <продолжение описания параметра>
////  <Параметр2>  - <Тип.Вид> - <описание параметра>
////                 <продолжение описания параметра>
////
//Процедура ЗапуститьОтчетНаСервере()

//	СхемаКомпоновкиДанных = Отчеты.АнализЖивогоСофта.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//	Настройки  = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

//КонецПроцедуры // ЗапуститьОтчетНаСервере()


&НаСервере
//Возвращает возможный для просмотра элемент
Функция ПолучитьСтруктуруОтбораРасшифровок(Расшифровка)

	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
	
	
	МассивПолейРасшифровки  = ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОтчета, Отчет.КомпоновщикНастроек);
	
	СтруктураОтбора = Новый Структура;
	Для каждого СтрокаМассива Из МассивПолейРасшифровки Цикл
		СтруктураОтбора.Вставить(СтрокаМассива.Поле, СтрокаМассива.Значение);
	КонецЦикла; 
	
	
	Если СтруктураОтбора.Количество() <> 0 Тогда
		Возврат СтруктураОтбора;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 

КонецФункции


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД));
	
	ВыполненноеДействие = Неопределено;
	ПараметрВыполненногоДействия = Неопределено;
	
	ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	СписокРасшифровать = Новый СписокЗначений;
	СписокРасшифровать.Добавить("АнализРазмещенияОбъектов", "По установленным программам");
	СписокРасшифровать.Добавить("АнализЖивогоСофта", "По программам без лицензии");
	СписокРасшифровать.Добавить("АнализЗакупленныхЛицензий", "По закупленным лицензиям");
	СписокРасшифровать.Добавить("АнализЛицензионногоСофта", "По размещенным лицензиям");
	СписокРасшифровать.Добавить("АнализСвободныхОстатковЛицензий", "По свободным лицензиям");
	
	
	ДополнительноеМеню = Новый СписокЗначений;
	ДополнительноеМеню.Добавить(СписокРасшифровать, "Расшифровать");
	
	ОбработкаРасшифровки.ВыбратьДействие(
		Расшифровка, 
		ВыполненноеДействие, 
		ПараметрВыполненногоДействия, 
		ДоступныеДействия,
		ДополнительноеМеню
	);
	
	
	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		ОткрытьЗначение(ПараметрВыполненногоДействия);
		
	ИначеЕсли НЕ ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда	
		
		СтруктураОтбора = ПолучитьСтруктуруОтбораРасшифровок(Расшифровка);
		
		СтруктураПараметров = Новый Структура("КлючВарианта, СтруктураОтбора", "Дополнительный", СтруктураОтбора);
		ПользовательскиеНастройки = ПолучитьПользовательскиеНастройки(ВыполненноеДействие, СтруктураПараметров);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",   Истина);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("КлючВарианта", "Дополнительный");
		
		СтрокаОтчета = "Отчет.АнализЖивогоСофта.Форма";
		СтрокаОтчета = СтрЗаменить(СтрокаОтчета, "АнализЖивогоСофта", ВыполненноеДействие);
		
		ОткрытьФорму(СтрокаОтчета, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает пользовательские настройки.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Пользовательские настроки отчета усОстаткиТоваров
//
Функция ПолучитьПользовательскиеНастройки(ТекущийОтчет, СтруктураПараметров)

    ПользовательскиеНастройки = ОбщегоНазначенияСервер.ПолучитьПользовательскиеНастройки(ТекущийОтчет, СтруктураПараметров.СтруктураОтбора, СтруктураПараметров.КлючВарианта);
    Возврат ПользовательскиеНастройки;

КонецФункции // ПолучитьПользовательскиеНастройки()

// Функция добавляет родителя к полю компоновки данных.
// ................................................................................
Функция ДобавитьРодителей(ЭлементРасшифровки, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы = Ложь) Экспорт
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), ТекущийОтчет);
			Если ДоступноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда
				Продолжить;
			КонецЕсли;
			МассивПолейРасшифровки.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьРодителей(Родитель, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	КонецЦикла;
	
КонецФункции


// Возвращает доступное поле по полю компоновки.
// ................................................................................
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")
		ИЛИ ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
		ИЛИ ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);    
	Иначе
		Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);       
	КонецЕсли;
	
КонецФункции


&НаСервере
// Возвращает массив, по которому следует расшифровать отчет.
// ................................................................................
Функция ПолучитьМассивПолейРасшифровки(Расшифровка, РасшифровкаОбъект, ТекущийОтчет = Неопределено, ВключатьРесурсы = Ложь) Экспорт
	
	//Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	МассивПолейРасшифровки = Новый Массив;
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") 
		И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		Возврат МассивПолейРасшифровки;
	КонецЕсли;
	
	Если ТекущийОтчет = Неопределено Тогда
		//ТекущийОтчет = Данные;
		ТекущийОтчет = РасшифровкаОбъект;
	КонецЕсли;
	
	// Добавим поля родительских группировок
	//ДобавитьРодителей(Данные.Элементы[Расшифровка], ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	ДобавитьРодителей(РасшифровкаОбъект.Элементы[Расшифровка], ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	
	Количество = МассивПолейРасшифровки.Количество();
	Для Индекс = 1 По Количество Цикл
		ОбратныйИндекс = Количество - Индекс;
		Для ИндексВнутри = 0 По ОбратныйИндекс - 1 Цикл
			Если МассивПолейРасшифровки[ОбратныйИндекс].Поле = МассивПолейРасшифровки[ИндексВнутри].Поле Тогда
				МассивПолейРасшифровки.Удалить(ОбратныйИндекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Добавим отбор, установленный в отчете
	Для каждого ЭлементОтбора Из ТекущийОтчет.Настройки.Отбор.Элементы Цикл
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		МассивПолейРасшифровки.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	Возврат МассивПолейРасшифровки;
	
КонецФункции

