/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ

//**************************************************** Создание описание Таблиц*********************************************
Функция СоздатьТаблицуСОписаниемЗагрузки() Экспорт

	ТЗ_ОписаниеЗагружаемыхОбъектов = Новый ТаблицаЗначений;
	ТЗ_ОписаниеЗагружаемыхОбъектов.Колонки.Добавить("ИмяОбъекта",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	ТЗ_ОписаниеЗагружаемыхОбъектов.Колонки.Добавить("НаименованиеОбъекта",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	
	Возврат ТЗ_ОписаниеЗагружаемыхОбъектов;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ДАННЫХ ИЗ АД

//**************************************************** Создание описание Таблиц*********************************************
Функция СоздатьТаблицуПользователейWindowsLDAP() Экспорт
	
	ТЗ_ПользователейWindowsLDAP = Новый ТаблицаЗначений;
	
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Наименование",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Компания",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Отдел",  				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Должность",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("ИмяДомена",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Логин",  				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("ПочтовыйАдрес",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Описание",  			Новый ОписаниеТипов("Строка"));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Фамилия",  			Новый ОписаниеТипов("Строка"));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Имя",  				Новый ОписаниеТипов("Строка"));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Отключен",  			Новый ОписаниеТипов("Булево"));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Дивизион",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Руководитель",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("БизнесЮнит",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("МестоНахождение",  	Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_ПользователейWindowsLDAP.Колонки.Добавить("Телефоны",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	
	Возврат ТЗ_ПользователейWindowsLDAP;
	
КонецФункции
Функция СоздатьТаблицуКомпьютеровWindowsLDAP() Экспорт
	
	ТЗ_КомпьютеровWindowsLDAP = Новый ТаблицаЗначений;
	
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("ИмяДомена", 			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Логин",  				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Наименование",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("ПочтовыйАдрес",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Описание",  			Новый ОписаниеТипов("Строка"));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Фамилия",  				Новый ОписаниеТипов("Строка"));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Имя",  					Новый ОписаниеТипов("Строка"));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Отключен",  			Новый ОписаниеТипов("Булево"));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Дивизион",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Должность",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Отдел",  				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Руководитель",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("БизнесЮнит",  			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("МестоНахождение",  		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Телефоны", 				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("Компания", 				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ТЗ_КомпьютеровWindowsLDAP.Колонки.Добавить("ФизЛицо", 				Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	
	Возврат ТЗ_КомпьютеровWindowsLDAP;
	
КонецФункции

//**************************************************** Получение данных *********************************************
Функция ПолучитьТаблицуПользователейWindowsLDAP(ИмяДомена, ПользовательLDAP, ПарольLDAP, ИнтернетПочтовыйАдрес=Неопределено, ФильтрОрганизация = Неопределено)

	ТЗ_ПользователейWindowsLDAP = СоздатьТаблицуПользователейWindowsLDAP();
	
	oADConnection = Новый COMObject("ADODB.Connection");
	oADConnection.Provider 			= "ADsDSOObject";
	oADConnection.ConnectionTimeout = 10;
	//oADConnection.ConnectionString	= "Provider=ADsDSOObject;Encrypt Password=False;Mode=Read;Bind Flags=0;ADSI Flag=-2147483648;User ID=" + ИмяДомена + "\" + ПользовательLDAP + ";Password=" + ПарольLDAP;
	oADConnection.ConnectionString	= "Provider=ADsDSOObject;Encrypt Password=False;Mode=Read;Bind Flags=0;ADSI Flag=-2147483648;User ID=" + ПользовательLDAP + ";Password=" + ПарольLDAP;
	oADConnection.Open();
	
	cmd = "Select DisplayName, userAccountControl, sAMAccountName, givenName, title, company, department, mail, cn, sn, Description, objectClass, manager, extensionAttribute15, physicalDeliveryOfficeName, telephoneNumber FROM 'LDAP://"+ИмяДомена+"'
		| WHERE objectClass='user' and objectCategory='Person'";
	
	Если ИнтернетПочтовыйАдрес <> Неопределено Тогда
		cmd = СтрЗаменить(cmd, "WHERE ", "WHERE mail='" + СокрЛП(ИнтернетПочтовыйАдрес.Адрес) + "' and ");
	КонецЕсли;
	
	Если ФильтрОрганизация <> Неопределено Тогда
		cmd = СтрЗаменить(cmd, "WHERE ", "WHERE company='" + ФильтрОрганизация + "' and ");
	КонецЕсли; 
	
	Попытка
		oRS = oADConnection.Execute(cmd);
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Если НЕ oRS.EOF Тогда
		
		oRS.MoveFirst();
		
		Пока НЕ oRS.EOF Цикл
			
			СтрокаТаблицаПользователей = ТЗ_ПользователейWindowsLDAP.Добавить();
			
			СтрокаТаблицаПользователей.Наименование					 	= СокрЛП(oRS.Fields("DisplayName").Value);
			СтрокаТаблицаПользователей.Логин							= СокрЛП(oRS.Fields("sAMAccountName").Value);
			СтрокаТаблицаПользователей.ПочтовыйАдрес 					= СокрЛП(oRS.Fields("mail").Value);
			СтрокаТаблицаПользователей.Описание						 	= ?(oRS.Fields("Description").Value <> NULL И oRS.Fields("Description").Value.Unload().Количество()>0, oRS.Fields("Description").Value.Unload()[0], "");
			СтрокаТаблицаПользователей.Фамилия				 			= СокрЛП(oRS.Fields("sn").Value);
			СтрокаТаблицаПользователей.Имя 								= СокрЛП(oRS.Fields("givenName").Value);
			СтрокаТаблицаПользователей.Отключен 						= ?(oRS.Fields("userAccountControl").Value = 512 ИЛИ oRS.Fields("userAccountControl").Value = 66048 ИЛИ oRS.Fields("userAccountControl").Value = 66080, Ложь, Истина);
			СтрокаТаблицаПользователей.Компания 						= oRS.Fields("company").Value;
			СтрокаТаблицаПользователей.Должность						= oRS.Fields("title").Value;
	        СтрокаТаблицаПользователей.Отдел 							= oRS.Fields("department").Value;
	        СтрокаТаблицаПользователей.Руководитель						= Сред(oRS.Fields("manager").Value, Найти(oRS.Fields("manager").Value, "CN=") + 3, Найти(oRS.Fields("manager").Value, ",")-4);
	        СтрокаТаблицаПользователей.БизнесЮнит						= oRS.Fields("extensionAttribute15").Value;
	        СтрокаТаблицаПользователей.МестоНахождение					= oRS.Fields("physicalDeliveryOfficeName").Value;
	        СтрокаТаблицаПользователей.Телефоны							= oRS.Fields("telephoneNumber").Value;
			
	        СтрокаТаблицаПользователей.ИмяДомена						= ИмяДомена;
			
			oRS.MoveNext();
			
		КонецЦикла;	
		
		ТЗ_ПользователейWindowsLDAP.Сортировать("Наименование");
		
	КонецЕсли;
	
	Если oADConnection.State = 1 Then
		oADConnection.Close();
	КонецЕсли;
	
	oADConnection = 0;
	
	Возврат ТЗ_ПользователейWindowsLDAP;
	
КонецФункции
Функция ПолучитьТаблицуКомпьютеровWindowsLDAP(ИмяДомена, ПользовательLDAP, ПарольLDAP, ФильтрОрганизация = Неопределено)

	ТЗ_КомпьютеровWindowsLDAP = СоздатьТаблицуКомпьютеровWindowsLDAP();

	oADConnection = Новый COMObject("ADODB.Connection");
	oADConnection.Provider 			= "ADsDSOObject";
	oADConnection.ConnectionTimeout = 10;
	//oADConnection.ConnectionString	= "Provider=ADsDSOObject;Encrypt Password=False;Mode=Read;Bind Flags=0;ADSI Flag=-2147483648;User ID=" + ИмяДомена + "\" + ПользовательLDAP + ";Password=" + ПарольLDAP;
	oADConnection.ConnectionString	= "Provider=ADsDSOObject;Encrypt Password=False;Mode=Read;Bind Flags=0;ADSI Flag=-2147483648;User ID=" + ПользовательLDAP + ";Password=" + ПарольLDAP;
	oADConnection.Open();
	
	cmd = "Select DisplayName, userAccountControl, sAMAccountName, Name, givenName, managedby, title, company, department, mail, cn, sn, Description, objectClass, manager, extensionAttribute15, physicalDeliveryOfficeName, telephoneNumber FROM 'LDAP://"+ИмяДомена+"'
		| WHERE objectClass='computer'";
	
	Если ФильтрОрганизация <> Неопределено Тогда
		cmd = СтрЗаменить(cmd, "WHERE ", "WHERE company='" + ФильтрОрганизация + "' and ");
	КонецЕсли; 
	
	Попытка
		oRS = oADConnection.Execute(cmd);
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Если НЕ oRS.EOF Тогда
		
		oRS.MoveFirst();
		
		Пока НЕ oRS.EOF Цикл
			
			СтрокаТаблицаПользователей = ТЗ_КомпьютеровWindowsLDAP.Добавить();
			
			СтрокаТаблицаПользователей.Наименование					 	= СокрЛП(oRS.Fields("Name").Value);
			СтрокаТаблицаПользователей.Логин							= СокрЛП(oRS.Fields("sAMAccountName").Value);
			СтрокаТаблицаПользователей.ПочтовыйАдрес 					= СокрЛП(oRS.Fields("mail").Value);
			СтрокаТаблицаПользователей.Описание						 	= ?(oRS.Fields("Description").Value <> NULL И oRS.Fields("Description").Value.Unload().Количество()>0, oRS.Fields("Description").Value.Unload()[0], "");
			СтрокаТаблицаПользователей.Фамилия				 			= СокрЛП(oRS.Fields("sn").Value);
			СтрокаТаблицаПользователей.Имя 								= СокрЛП(oRS.Fields("givenName").Value);
			СтрокаТаблицаПользователей.Отключен 						= ?(oRS.Fields("userAccountControl").Value = 512 ИЛИ oRS.Fields("userAccountControl").Value = 66048 ИЛИ oRS.Fields("userAccountControl").Value = 66080, Ложь, Истина);
			СтрокаТаблицаПользователей.Компания 						= oRS.Fields("company").Value;
			СтрокаТаблицаПользователей.Должность						= oRS.Fields("title").Value;
	        СтрокаТаблицаПользователей.Отдел 							= oRS.Fields("department").Value;
	        СтрокаТаблицаПользователей.Руководитель						= Сред(oRS.Fields("manager").Value, Найти(oRS.Fields("manager").Value, "CN=") + 3, Найти(oRS.Fields("manager").Value, ",")-4);
	        СтрокаТаблицаПользователей.БизнесЮнит						= oRS.Fields("extensionAttribute15").Value;
	        СтрокаТаблицаПользователей.МестоНахождение					= oRS.Fields("physicalDeliveryOfficeName").Value;
	        СтрокаТаблицаПользователей.Телефоны							= oRS.Fields("telephoneNumber").Value;
	        СтрокаТаблицаПользователей.ФизЛицо							= Сред(oRS.Fields("managedby").Value, Найти(oRS.Fields("managedby").Value, "CN=") + 3, Найти(oRS.Fields("managedby").Value, ",")-4);
			
	        СтрокаТаблицаПользователей.ИмяДомена						= ИмяДомена;
			
			oRS.MoveNext();
			
		КонецЦикла;	
		
		ТЗ_КомпьютеровWindowsLDAP.Сортировать("Наименование");
		
	КонецЕсли;
	
	Если oADConnection.State = 1 Then
		oADConnection.Close();
	КонецЕсли;
	
	oADConnection = 0;
	
	Возврат ТЗ_КомпьютеровWindowsLDAP;
КонецФункции

//**************************************************** Заполнение данных по загрузке *********************************************
Процедура ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, ИмяОбъекта, НаименованиеОбъекта)
	
	Стр_ТЗ = ТЗ_ОписаниеЗагружаемыхОбъектов.Добавить();
	
	Стр_ТЗ.ИмяОбъекта 			= ИмяОбъекта;	
	Стр_ТЗ.НаименованиеОбъекта 	= НаименованиеОбъекта;	
	
КонецПроцедуры

//**************************************************** Загрука справочников из АД *********************************************
Процедура ЗагрузитьДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, ИмяСправочника, ИмяРекАнализа)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_Данные
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.ИмяРекАнализа КАК НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_ДанныеАД
	               |ИЗ
	               |	&ТаблицаПользователейWindowsLDAP КАК ПользователиАД
	               |ГДЕ
	               |	ПользователиАД.ИмяРекАнализа <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ДанныеАД.НаименованиеСинхронизации
	               |ИЗ
	               |	ВР_ДанныеАД КАК ВР_ДанныеАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Данные КАК ВР_Данные
	               |		ПО ВР_ДанныеАД.НаименованиеСинхронизации = ВР_Данные.НаименованиеСинхронизации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВР_Данные.НаименованиеСинхронизации, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
				   
	ТЗ_Данных = ТЗ_ПользователейWindowsLDAP.Скопировать();
	ТЗ_Данных.Свернуть(ИмяРекАнализа);
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_Данных);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИмяРекАнализа",ИмяРекАнализа);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ФизическиеЛица",ИмяСправочника);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		Спр_Об = Справочники[ИмяСправочника].СоздатьЭлемент();
		
		Спр_Об.Наименование 				= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.НаименованиеПолное 			= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.НаименованиеСинхронизации 	= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		
		Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, ИмяСправочника, Спр_Об.НаименованиеСинхронизации);
		
	КонецЦикла;
	
КонецПроцедуры
Процедура ЗагрузитьПодразделенияИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ПодразделенияОрганизаций.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ПодразделенияОрганизаций.Родитель.НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_ДанныеПодразделения
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |ГДЕ
	               |	ПодразделенияОрганизаций.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Организации.Ссылка КАК Ссылка,
	               |	ПОДСТРОКА(Организации.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_ДанныеОрганизации
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ДанныеОрганизации.НаименованиеСинхронизации КАК НаименованиеСинхронизации,
	               |	ВР_ДанныеОрганизации.Ссылка КАК Организация
	               |ИЗ
	               |	ВР_ДанныеОрганизации КАК ВР_ДанныеОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ДанныеПодразделения КАК ВР_ДанныеПодразделения
	               |		ПО ВР_ДанныеОрганизации.НаименованиеСинхронизации = ВР_ДанныеПодразделения.НаименованиеСинхронизации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВР_ДанныеПодразделения.НаименованиеСинхронизации, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
				   
	ТЗ_Данных = ТЗ_ПользователейWindowsLDAP.Скопировать();
	ТЗ_Данных.Свернуть("Компания, Отдел");
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_Данных);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
			Спр_Об = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
			
			Спр_Об.НаименованиеСинхронизации	= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
			Спр_Об.Наименование 				= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
			Спр_Об.НаименованиеПолное 			= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
			
			Спр_Об.Владелец 					= СтрокаТаблицаОсновная.Организация;
			
			Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ПодразделениеОрганизации", Спр_Об.НаименованиеСинхронизации);
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ПодразделенияОрганизаций.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ПОДСТРОКА(ПодразделенияОрганизаций.Владелец.НаименованиеСинхронизации, 1, 150) КАК ОрганизацияНаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_ДанныеПодразделения
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |ГДЕ
	               |	ПодразделенияОрганизаций.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.Компания,
	               |	ПользователиАД.Отдел
	               |ПОМЕСТИТЬ ВР_ДанныеАД
	               |ИЗ
	               |	&ТаблицаПользователейWindowsLDAP КАК ПользователиАД
	               |ГДЕ
	               |	ПользователиАД.Отдел <> """"
	               |	И ПользователиАД.Компания <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ДанныеАД.Отдел КАК НаименованиеСинхронизации,
	               |	ВР_ДанныеАД.Компания
	               |ИЗ
	               |	ВР_ДанныеАД КАК ВР_ДанныеАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ДанныеПодразделения КАК ВР_ДанныеПодразделения
	               |		ПО ВР_ДанныеАД.Отдел = ВР_ДанныеПодразделения.НаименованиеСинхронизации
	               |			И ВР_ДанныеАД.Компания = ВР_ДанныеПодразделения.ОрганизацияНаименованиеСинхронизации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВР_ДанныеПодразделения.НаименованиеСинхронизации, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
				   
	ТЗ_Данных = ТЗ_ПользователейWindowsLDAP.Скопировать();
	ТЗ_Данных.Свернуть("Компания, Отдел");
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_Данных);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		ТекОрганизация 	= Справочники.Организации.НайтиПоРеквизиту("НаименованиеСинхронизации", СтрокаТаблицаОсновная.Компания);
		
		Спр_Род = Справочники.ПодразделенияОрганизаций.НайтиПоРеквизиту("НаименованиеСинхронизации",СтрокаТаблицаОсновная.Компания,, ТекОрганизация);
		
		Спр_Об = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
		
		Спр_Об.НаименованиеСинхронизации	= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.Наименование 				= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.НаименованиеПолное 			= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		
		Спр_Об.Родитель 					= Спр_Род;
		Спр_Об.Владелец 					= ТекОрганизация;
		
		Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ПодразделениеОрганизации", Спр_Об.НаименованиеСинхронизации);
		
	КонецЦикла;
	
	
КонецПроцедуры
Процедура ЗагрузитьУчетныеДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	               |ПОМЕСТИТЬ УчетныеЗаписиЭлектроннойПочты
	               |ИЗ
	               |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.Логин,
	               |	ПользователиАД.Наименование,
	               |	ПользователиАД.ПочтовыйАдрес,
	               |	ПользователиАД.Описание,
	               |	ПользователиАД.Фамилия,
	               |	ПользователиАД.Имя,
	               |	ПользователиАД.Отключен,
	               |	ПользователиАД.Дивизион,
	               |	ПользователиАД.Должность,
	               |	ПользователиАД.Отдел,
	               |	ПользователиАД.Руководитель,
	               |	ПользователиАД.БизнесЮнит,
	               |	ПользователиАД.МестоНахождение,
	               |	ПользователиАД.Телефоны,
	               |	ПользователиАД.Компания
	               |ПОМЕСТИТЬ ПользователиАД
	               |ИЗ
	               |	&ТаблицаПользователейWindowsLDAP КАК ПользователиАД
	               |ГДЕ
	               |	ПользователиАД.ПочтовыйАдрес <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.Логин,
	               |	ПользователиАД.Наименование,
	               |	ПользователиАД.ПочтовыйАдрес,
	               |	ПользователиАД.Описание,
	               |	ПользователиАД.Фамилия,
	               |	ПользователиАД.Имя,
	               |	ПользователиАД.Отключен,
	               |	ПользователиАД.Дивизион,
	               |	ПользователиАД.Должность,
	               |	ПользователиАД.Отдел,
	               |	ПользователиАД.Руководитель,
	               |	ПользователиАД.БизнесЮнит,
	               |	ПользователиАД.МестоНахождение,
	               |	ПользователиАД.Телефоны,
	               |	ПользователиАД.Компания
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ
	               |	ПользователиАД КАК ПользователиАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |		ПО ПользователиАД.ПочтовыйАдрес = УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.Логин,
	               |	ВТ_Данные.Наименование,
	               |	ВТ_Данные.ПочтовыйАдрес,
	               |	ВТ_Данные.Описание,
	               |	ВТ_Данные.Фамилия,
	               |	ВТ_Данные.Имя,
	               |	ВТ_Данные.Отключен,
	               |	ВТ_Данные.Дивизион,
	               |	ВТ_Данные.Должность,
	               |	ВТ_Данные.Отдел,
	               |	ВТ_Данные.Руководитель,
	               |	ВТ_Данные.БизнесЮнит,
	               |	ВТ_Данные.МестоНахождение,
	               |	ВТ_Данные.Телефоны,
	               |	ВТ_Данные.Компания,
	               |	ДолжностиОрганизаций.Ссылка КАК СсылкаДолжность,
	               |	Организации.Ссылка КАК СсылкаОрганизация,
	               |	ПодразделенияОрганизаций.Ссылка КАК СсылкаПодразделение,
	               |	ФизическиеЛица.Ссылка КАК СсылкаФизЛицо
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |		ПО (ВТ_Данные.Отдел = ПОДСТРОКА(ПодразделенияОрганизаций.НаименованиеСинхронизации, 1, 150))
	               |			И (ВТ_Данные.Компания = ПОДСТРОКА(ПодразделенияОрганизаций.Владелец.НаименованиеСинхронизации, 1, 150))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО (ВТ_Данные.Компания = ПОДСТРОКА(Организации.НаименованиеСинхронизации, 1, 150))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
	               |		ПО (ВТ_Данные.Должность = ПОДСТРОКА(ДолжностиОрганизаций.НаименованиеСинхронизации, 1, 150))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО (ВТ_Данные.Наименование = ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150))";
				   
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_ПользователейWindowsLDAP);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		Спр_Об = Справочники.УчетныеЗаписиЭлектроннойПочты.СоздатьЭлемент();
		
		Спр_Об.Наименование 			= СтрокаТаблицаОсновная.ПочтовыйАдрес;
		Спр_Об.АдресЭлектроннойПочты 	= СтрокаТаблицаОсновная.ПочтовыйАдрес;
		Спр_Об.Пользователь 			= СтрокаТаблицаОсновная.Логин;
		Спр_Об.ИмяПользователя 			= СтрокаТаблицаОсновная.Наименование;
		Спр_Об.Руководитель 			= СтрокаТаблицаОсновная.Руководитель;
		Спр_Об.Телефон 					= СтрокаТаблицаОсновная.Телефоны;
		Спр_Об.Должность 				= СтрокаТаблицаОсновная.СсылкаДолжность;
		Спр_Об.Подразделение 			= СтрокаТаблицаОсновная.СсылкаПодразделение;
		Спр_Об.Организация 				= СтрокаТаблицаОсновная.СсылкаОрганизация;
		
		//Спр_Об. 		= СтрокаТаблицаОсновная.СсылкаФизЛицо;
		//Спр_Об. 		= СтрокаТаблицаОсновная.БизнесЮнит;
		//Спр_Об. 		= СтрокаТаблицаОсновная.МестоНахождение;
		//Спр_Об. 		= СтрокаТаблицаОсновная.Описание;
		//Спр_Об. 		= СтрокаТаблицаОсновная.Фамилия;
		//Спр_Об. 		= СтрокаТаблицаОсновная.Имя;
		//Спр_Об. 		= СтрокаТаблицаОсновная.Отключен;
		//Спр_Об. 		= СтрокаТаблицаОсновная.Дивизион;
		
		Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "УчетныеЗаписиЭлектроннойПочты", Спр_Об.АдресЭлектроннойПочты);
		
		Спр_Об_ФизЛицо = СтрокаТаблицаОсновная.СсылкаФизЛицо.ПолучитьОбъект();
		
		// Изменим принадлежность к фирме и подразделению Это для ввода начальных остатков
		Спр_Об_ФизЛицо.Организация 		= СтрокаТаблицаОсновная.СсылкаОрганизация;
		Спр_Об_ФизЛицо.Подразделение 	= СтрокаТаблицаОсновная.СсылкаПодразделение;
		
	    Стр_Уч = Спр_Об_ФизЛицо.УчетныеЗаписи.Добавить();
		Стр_Уч.УчетнаяЗапись = Спр_Об.Ссылка;
		
		Спр_Об_ФизЛицо.Записать();
		
	КонецЦикла; 

КонецПроцедуры
Процедура ЗагрузитьДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ОсновныеСредства
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |ГДЕ
	               |	ОсновныеСредства.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КомпьютерыАД.Логин,
	               |	КомпьютерыАД.Наименование,
	               |	КомпьютерыАД.ФизЛицо
	               |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	               |ИЗ
	               |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	               |ГДЕ
	               |	КомпьютерыАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КомпьютерыАД.Наименование КАК Наименование
	               |ИЗ
	               |	ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСредства КАК ОсновныеСредства
	               |		ПО ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ОсновныеСредства.НаименованиеСинхронизации, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
				   
	Запрос.УстановитьПараметр("ТЗ_КомпьютеровWindowsLDAP"	, ТЗ_КомпьютеровWindowsLDAP);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		Спр_Об = Справочники.ОсновныеСредства.СоздатьЭлемент();
		
		Спр_Об.НаименованиеСинхронизации 	= СтрокаТаблицаОсновная.Наименование;
		Спр_Об.Наименование 				= СтрокаТаблицаОсновная.Наименование;
		Спр_Об.НаименованиеПолное 			= СтрокаТаблицаОсновная.Наименование;
		
		Спр_Об.ВидОсновногоСредства 		= Справочники.ВидыОсновногоСредства.ПерсональныйКомпьютер;
		
		Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ОсновныеСредства", Спр_Об.НаименованиеСинхронизации);
		
	КонецЦикла; 

КонецПроцедуры


Процедура ЗагрузитьФизическиеЛицаИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации
	               |ПОМЕСТИТЬ ВР_Данные
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.НаименованиеСинхронизации <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.Наименование КАК НаименованиеСинхронизации,
	               |	ПользователиАД.Отдел КАК Отдел,
	               |	ПользователиАД.Компания КАК Компания
	               |ПОМЕСТИТЬ ВР_ДанныеАД
	               |ИЗ
	               |	&ТаблицаПользователейWindowsLDAP КАК ПользователиАД
	               |ГДЕ
	               |	ПользователиАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ДанныеАД.НаименованиеСинхронизации,
	               |	ВР_ДанныеАД.Отдел,
	               |	ВР_ДанныеАД.Компания
	               |ИЗ
	               |	ВР_ДанныеАД КАК ВР_ДанныеАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Данные КАК ВР_Данные
	               |		ПО ВР_ДанныеАД.НаименованиеСинхронизации = ВР_Данные.НаименованиеСинхронизации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВР_Данные.НаименованиеСинхронизации, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
				   
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_ПользователейWindowsLDAP);
	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		Спр_Об = Справочники.ФизическиеЛица.СоздатьЭлемент();
		
		Спр_Об.Наименование 				= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.НаименованиеПолное 			= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		Спр_Об.НаименованиеСинхронизации 	= СтрокаТаблицаОсновная.НаименованиеСинхронизации;
		
		НайденнаяОрганизация = Справочники.Организации.НайтиПоРеквизиту("НаименованиеСинхронизации", СтрокаТаблицаОсновная.Компания);
		Если НайденнаяОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда
			Спр_Об.Организация	= НайденнаяОрганизация;
			
			НайденноеПодразделение = Справочники.ПодразделенияОрганизаций.НайтиПоРеквизиту("НаименованиеСинхронизации", СтрокаТаблицаОсновная.Отдел,, НайденнаяОрганизация);
			Если НайденноеПодразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
				Спр_Об.Подразделение	= НайденноеПодразделение;
			КонецЕсли;	
			
		КонецЕсли;
		
		Спр_Об.Записать();
		
		ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ФизическиеЛица", Спр_Об.НаименованиеСинхронизации);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьПодразделенияФизЛицИзАД(ТЗ_ПользователейWindowsLDAP)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ФизическиеЛица.Ссылка КАК ФизЛицо
	               |ПОМЕСТИТЬ ВР_Данные
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.НаименованиеСинхронизации <> """"
	               |	И ФизическиеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользователиАД.Наименование КАК НаименованиеСинхронизации,
	               |	ПользователиАД.Отдел КАК Отдел,
	               |	ПользователиАД.Компания КАК Компания
	               |ПОМЕСТИТЬ ВР_ДанныеАД
	               |ИЗ
	               |	&ТаблицаПользователейWindowsLDAP КАК ПользователиАД
	               |ГДЕ
	               |	ПользователиАД.Наименование <> """"
	               |	И ПользователиАД.Отдел <> """"
	               |	И ПользователиАД.Компания <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ДанныеАД.НаименованиеСинхронизации,
	               |	ЕСТЬNULL(ВР_ДанныеАД.Отдел, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Отдел,
	               |	ЕСТЬNULL(ВР_ДанныеАД.Компания, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Компания,
	               |	ЕСТЬNULL(ВР_Данные.ФизЛицо,  ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизЛицо
	               |ИЗ
	               |	ВР_Данные КАК ВР_Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ДанныеАД КАК ВР_ДанныеАД
	               |		ПО ВР_Данные.НаименованиеСинхронизации = ВР_ДанныеАД.НаименованиеСинхронизации";
	
				   
	Запрос.УстановитьПараметр("ТаблицаПользователейWindowsLDAP"	, ТЗ_ПользователейWindowsLDAP);
	
	Результат = Запрос.Выполнить();
	//ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	
	Выборка = Результат.Выбрать();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Пока Выборка.Следующий()  Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ФизЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		Спр_Об = Выборка.ФизЛицо.ПолучитьОбъект();
		
		Записать = Ложь;
		Если НЕ ЗначениеЗаполнено(Спр_Об.Организация) Тогда
		
			НайденнаяОрганизация = Справочники.Организации.НайтиПоРеквизиту("НаименованиеСинхронизации", Выборка.Компания);
			Если НайденнаяОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда
				Спр_Об.Организация	= НайденнаяОрганизация;
				Записать = Истина;
			КонецЕсли;
			
		Иначе
			НайденнаяОрганизация = Спр_Об.Организация;
		КонецЕсли;	
		
		НайденноеПодразделение = Справочники.ПодразделенияОрганизаций.НайтиПоРеквизиту("НаименованиеСинхронизации", Выборка.Отдел,, НайденнаяОрганизация);
		Если НайденноеПодразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			Спр_Об.Подразделение	= НайденноеПодразделение;
			Записать = Истина;
		КонецЕсли;	
		
		Если Записать Тогда
			Спр_Об.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция СоздатьИЗапуститьБизнесПроцесс(СтруктураДанных) Экспорт
	
	БизнесПроцесс = БизнесПроцессы.ЗаданиеСРолевойАдресацией.СоздатьБизнесПроцесс();
	БизнесПроцесс.Дата = СтруктураДанных.Дата;
	
	БизнесПроцесс.Заполнить(СтруктураДанных);
	
	БизнесПроцесс.Записать();
	БизнесПроцесс.Старт(БизнесПроцессы.ЗаданиеСРолевойАдресацией.ТочкиМаршрута.Старт);
	БизнесПроцесс.АктивироватьИнтерактивно();
	
	Возврат БизнесПроцесс.Ссылка;
	
КонецФункции //СоздатьИЗапуститьБизнессПроцесс	

Процедура СформироватьСписание(СтруктураДокумента) Экспорт
	
	ДокументОбъект = Документы.СписаниеОС.СоздатьДокумент();
	ДокументОбъект.Заполнить(СтруктураДокумента);
	
	ДокументОбъект.Дата = СтруктураДокумента.Дата;
	
	Если СтруктураДокумента.Свойство("ТабличныеЧасти") Тогда
		
		Для каждого ТабличнаяЧасть Из СтруктураДокумента.ТабличныеЧасти Цикл
			
			ДокументОбъект[ТабличнаяЧасть.Ключ].Загрузить(ТабличнаяЧасть.Значение);	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//СоздатьИЗапуститьБизнесПроцесс(ДокументОбъект.Ссылка);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ДокументОбъект.Ссылка, );   
	КонецПопытки;
	
КонецПроцедуры //СформироватьСписание	

Процедура ОтключитьКомпьютерыИзАд(ТЗ_КомпьютеровWindowsLDAP, ИмяДомена)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	//			   |	ОсновныеСредства.Ссылка
	//			   |ПОМЕСТИТЬ ОсновныеСредства
	//			   |ИЗ
	//			   |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	//			   |ГДЕ
	//			   |	ОсновныеСредства.НаименованиеСинхронизации <> """"
	//			   |	И ОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.ПерсональныйКомпьютер)
	//			   |	И НЕ ОсновныеСредства.Отключен
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	КомпьютерыАД.Логин,
	//			   |	КомпьютерыАД.Наименование,
	//			   |	КомпьютерыАД.ФизЛицо
	//			   |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	//			   |ИЗ
	//			   |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	//			   |ГДЕ
	//			   |	КомпьютерыАД.Наименование <> """"
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	ОсновныеСредства.Ссылка КАК ОсновноеСредство
	//			   |ИЗ
	//			   |	ОсновныеСредства КАК ОсновныеСредства
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	//			   |		ПО (ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации)
	//			   |ГДЕ
	//			   |	ВЫБОР
	//			   |			КОГДА ЕСТЬNULL(ВТ_КомпьютерыАД.Наименование, ИСТИНА) = ИСТИНА
	//			   |				ТОГДА ИСТИНА
	//			   |			ИНАЧЕ ЛОЖЬ
	//			   |		КОНЕЦ";
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомпьютерыДомена.НаименованиеСинхронизации,
	               |	КомпьютерыДомена.Ссылка
	               |ПОМЕСТИТЬ ОсновныеСредства
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |		ОсновныеСредства.Ссылка КАК Ссылка,
	               |		ЕСТЬNULL(ОтключенныеКомпьютерыСрезПоследних.Отключен, ЛОЖЬ) КАК Отключен,
	               |		МестонахождениеОССрезПоследних.ИмяДомена КАК ИмяДомена
	               |	ИЗ
	               |		Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтключенныеКомпьютеры.СрезПоследних КАК ОтключенныеКомпьютерыСрезПоследних
	               |			ПО ОсновныеСредства.Ссылка = ОтключенныеКомпьютерыСрезПоследних.ИдентификаторКомпьютера
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОССрезПоследних
	               |			ПО ОсновныеСредства.Ссылка = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |	ГДЕ
	               |		ОсновныеСредства.НаименованиеСинхронизации <> """"
	               |		И ОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.ПерсональныйКомпьютер)
	               |		И МестонахождениеОССрезПоследних.ИмяДомена = &ИмяДомена) КАК КомпьютерыДомена
	               |ГДЕ
	               |	НЕ КомпьютерыДомена.Отключен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КомпьютерыАД.Логин,
	               |	КомпьютерыАД.Наименование,
	               |	КомпьютерыАД.ИмяДомена
	               |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	               |ИЗ
	               |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	               |ГДЕ
	               |	КомпьютерыАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновныеСредства.Ссылка КАК ОсновноеСредство
	               |ИЗ
	               |	ОсновныеСредства КАК ОсновныеСредства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	               |		ПО (ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВТ_КомпьютерыАД.Наименование, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
				   
	Запрос.УстановитьПараметр("ТЗ_КомпьютеровWindowsLDAP"	, ТЗ_КомпьютеровWindowsLDAP);
	Запрос.УстановитьПараметр("ИмяДомена", ИмяДомена);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	//Для каждого Строка Из ТаблицаРезультата Цикл
	//	
	//	СправочникОбъект = Строка.ОсновноеСредство.ПолучитьОбъект();
	//	СправочникОбъект.Отключен = Истина;
	//	
	//	Попытка
	//		СправочникОбъект.Записать();
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), Строка.ОсновноеСредство, );
	//	КонецПопытки;	
	//	
	//КонецЦикла;	
	
	Если ТаблицаРезультата.Количество() > 0 Тогда
	
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Дата", ТекущаяДата());
		СтруктураДокумента.Вставить("Комментарий", "Сформирован автоматически по данным загрузки");
		СтруктураДокумента.Вставить("ТабличныеЧасти", Новый Структура("ОсновныеСредства", ТаблицаРезультата));
		СформироватьСписание(СтруктураДокумента);
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры	


Процедура ЗагрузитьДоменыДляКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ОсновныеСредства.Ссылка
	               |ПОМЕСТИТЬ ОсновныеСредства
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |ГДЕ
	               |	ОсновныеСредства.НаименованиеСинхронизации <> """"
	               |	И ОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.ПерсональныйКомпьютер)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КомпьютерыАД.Логин,
	               |	КомпьютерыАД.Наименование,
	               |	КомпьютерыАД.ИмяДомена
	               |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	               |ИЗ
	               |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	               |ГДЕ
	               |	КомпьютерыАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	               |	ВТ_КомпьютерыАД.ИмяДомена КАК СтрокаДомена
	               |ИЗ
	               |	ОсновныеСредства КАК ОсновныеСредства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	               |		ПО (ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВТ_КомпьютерыАД.Наименование, ИСТИНА) = ИСТИНА
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
				   
	Запрос.УстановитьПараметр("ТЗ_КомпьютеровWindowsLDAP"	, ТЗ_КомпьютеровWindowsLDAP);
	
	//ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяДомена = Справочники.ИдентификаторыДоменов.НайтиПоНаименованию(Выборка.СтрокаДомена);
		Если ИмяДомена = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//Необходимо выбрать последнюю запись регистра сведений МестоположениеОС и записать в нее имя домена
		НаборЗаписей	= РегистрыСведений.ДоменыКомпьютеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторКомпьютера.Установить(Выборка.ОсновноеСредство);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ИдентификаторКомпьютера = Выборка.ОсновноеСредство;
			НоваяЗапись.ИмяДомена = ИмяДомена;
		
		КонецЕсли; 
		
		НаборЗаписей.Записать();
		
		//Прервать;
	
	КонецЦикла; 
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры //ЗагрузитьДоменыДляКомпьютеровИзАД
	

Процедура ЗагрузитьСправочникиИзАД(ТЗ_ОписаниеЗагружаемыхОбъектов, ТЗ_ПользователейWindowsLDAP, ТЗ_КомпьютеровWindowsLDAP, ФильтрОрганизация, ИмяДомена)
	
	// ДЛЯ ОРГАНИЗАЦИИ ЛИЦ БАЗЫ ДАННЫХ
	Если ФильтрОрганизация = Неопределено Тогда
		ЗагрузитьДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, "Организации", "Компания");
	КонецЕсли;
	
	// ДЛЯ ПОДРАЗДЕЛЕНИЕ ЛИЦ БАЗЫ ДАННЫХ
	ЗагрузитьПодразделенияИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов);
	
	// ДЛЯ ФИЗИЧЕСКИХ ЛИЦ БАЗЫ ДАННЫХ
	//ЗагрузитьДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, "ФизическиеЛица", "Наименование");
	ЗагрузитьФизическиеЛицаИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов);
	
	ЗаполнитьПодразделенияФизЛицИзАД(ТЗ_ПользователейWindowsLDAP);
	
	// ДЛЯ ДОЛЖНОСТИ ЗАПИСЕЙ БАЗЫ ДАННЫХ
	ЗагрузитьДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, "ДолжностиОрганизаций", "Должность");
	
	
	// ДЛЯ УЧЕТНЫХ ДАННЫХ БАЗЫ ДАННЫХ
	ЗагрузитьУчетныеДанныеИзАД(ТЗ_ПользователейWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов);
	
		
	// ДЛЯ КОМПЬЮТЕРОВ БАЗЫ ДАННЫХ
	ЗагрузитьДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов);
	
	//// Пометим компьютеры, отстутствующие в АД, как отключенные
	ОтключитьКомпьютерыИзАд(ТЗ_КомпьютеровWindowsLDAP, ИмяДомена);
	
	//Заполнить данные по принадлежности к доменам для основных средств
	//ЗагрузитьДоменыДляКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP);
	
КонецПроцедуры

//**************************************************** Загрука документов из АД *********************************************
Процедура ЗагрузитьНачальныеДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиЭлектроннойПочты.Ссылка,
	               |	УчетныеЗаписиЭлектроннойПочты.Подразделение,
	               |	УчетныеЗаписиЭлектроннойПочты.Организация
	               |ПОМЕСТИТЬ ВТ_Учетки
	               |ИЗ
	               |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ОсновныеСредства.Ссылка
	               |ПОМЕСТИТЬ ОсновныеСредства
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КомпьютерыАД.Логин,
	               |	КомпьютерыАД.Наименование,
	               |	КомпьютерыАД.ФизЛицо
	               |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	               |ИЗ
	               |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	               |ГДЕ
	               |	КомпьютерыАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КомпьютерыАД.Наименование КАК Наименование,
	               |	ФизическиеЛица.Ссылка КАК ФизЛицо,
	               |	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	               |	ФизическиеЛица.Подразделение,
	               |	ФизическиеЛица.Организация КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.Москва) КАК Помещение
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСредства КАК ОсновныеСредства
	               |			ПО ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации
	               |		ПО (ВЫБОР
	               |				КОГДА ВТ_КомпьютерыАД.ФизЛицо = """"
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ВТ_КомпьютерыАД.ФизЛицо = ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150)
	               |			КОНЕЦ)
	               |ИТОГИ ПО
	               |	Организация";
				   
	Запрос.УстановитьПараметр("ТЗ_КомпьютеровWindowsLDAP"	, ТЗ_КомпьютеровWindowsLDAP);
	
	Рез_Запроса_ОС = Запрос.Выполнить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Выб_Рез_Организации = Рез_Запроса_ОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока Выб_Рез_Организации.Следующий() Цикл
		
		Если Ф_Отказ Тогда
			Прервать;	
		КонецЕсли; 
		
		Док_ВводНачальныхОстатковОС = Документы.ВводНачальныхОстатковОС.СоздатьДокумент();
		
		Док_ВводНачальныхОстатковОС.Дата 		= ТекущаяДата();
		Док_ВводНачальныхОстатковОС.Организация = Выб_Рез_Организации.Организация;
		
		Док_ВводНачальныхОстатковОС.Ответственный = Пользователи.ТекущийПользователь();		//Комиссаров: 01/08/2013
		
		Выб_Рез_ДетЗ = Выб_Рез_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока Выб_Рез_ДетЗ.Следующий() Цикл
			
			Стр_ОС = Док_ВводНачальныхОстатковОС.ОсновныеСредства.Добавить();
			
			Стр_ОС.ДатаВводаВЭксплуатацию 	= ТекущаяДата();
			Стр_ОС.ДатаПринятияКУчету 		= ТекущаяДата();
			Стр_ОС.ОсновноеСредство 		= Выб_Рез_ДетЗ.ОсновноеСредство;
			Стр_ОС.КлючСвязи 				= РаботаСТабличнымиЧастямиСервер.СоздатьНовыйКлючСвязи(Док_ВводНачальныхОстатковОС, "ОсновныеСредства");
			Стр_ОС.МОЛ 						= Выб_Рез_ДетЗ.ФизЛицо; 
			Стр_ОС.ПодразделениеОрганизации = Выб_Рез_ДетЗ.Подразделение; 
			Стр_ОС.Помещение 				= Выб_Рез_ДетЗ.Помещение;
		
			ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ВводНачальныхОстатковОС", Выб_Рез_ДетЗ.ОсновноеСредство);
			
		КонецЦикла; 
		
		Если Док_ВводНачальныхОстатковОС.ОсновныеСредства.Количество() > 0 Тогда
			Попытка
				Если Ф_ПровестиСозданныеДокументы и Док_ВводНачальныхОстатковОС.ОсновныеСредства.Количество() > 0 Тогда
					Док_ВводНачальныхОстатковОС.Записать(РежимЗаписиДокумента.Проведение);
				Иначе	
					Док_ВводНачальныхОстатковОС.Записать();
				КонецЕсли; 
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), Ф_Отказ, );
			КонецПопытки;
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры
Процедура ЗагрузитьИзмененныеДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ)
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиЭлектроннойПочты.Ссылка,
	               |	УчетныеЗаписиЭлектроннойПочты.Подразделение,
	               |	УчетныеЗаписиЭлектроннойПочты.Организация
	               |ПОМЕСТИТЬ ВТ_Учетки
	               |ИЗ
	               |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПОДСТРОКА(ОсновныеСредства.НаименованиеСинхронизации, 1, 150) КАК НаименованиеСинхронизации,
	               |	ОсновныеСредства.Ссылка
	               |ПОМЕСТИТЬ ОсновныеСредства
	               |ИЗ
	               |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КомпьютерыАД.Логин,
	               |	КомпьютерыАД.Наименование,
	               |	КомпьютерыАД.ФизЛицо,
	               |	КомпьютерыАД.ИмяДомена
	               |ПОМЕСТИТЬ ВТ_КомпьютерыАД
	               |ИЗ
	               |	&ТЗ_КомпьютеровWindowsLDAP КАК КомпьютерыАД
	               |ГДЕ
	               |	КомпьютерыАД.Наименование <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КомпьютерыАД.Наименование КАК Наименование,
	               |	ФизическиеЛица.Ссылка КАК ФизЛицо,
	               |	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	               |	ФизическиеЛица.Подразделение,
	               |	ФизическиеЛица.Организация,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.Москва) КАК Помещение,
	               |	ВТ_КомпьютерыАД.ИмяДомена
	               |ПОМЕСТИТЬ ВТ_ДанныеЗагрузки
	               |ИЗ
	               |	ВТ_КомпьютерыАД КАК ВТ_КомпьютерыАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСредства КАК ОсновныеСредства
	               |		ПО ВТ_КомпьютерыАД.Наименование = ОсновныеСредства.НаименованиеСинхронизации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО (ВЫБОР
	               |				КОГДА ВТ_КомпьютерыАД.ФизЛицо = """"
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ВТ_КомпьютерыАД.ФизЛицо = ПОДСТРОКА(ФизическиеЛица.НаименованиеСинхронизации, 1, 150)
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеЗагрузки.Наименование,
	               |	ВТ_ДанныеЗагрузки.ФизЛицо,
	               |	ВТ_ДанныеЗагрузки.ОсновноеСредство,
	               |	ВТ_ДанныеЗагрузки.Подразделение,
	               |	ВТ_ДанныеЗагрузки.Организация КАК Организация,
	               |	ВТ_ДанныеЗагрузки.Помещение,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(МестонахождениеОССрезПоследних1.ОсновноеСредство, ИСТИНА) = ИСТИНА
	               |			ТОГДА ""НовоеОС""
	               |		КОГДА ЕСТЬNULL(МестонахождениеОССрезПоследних.ОсновноеСредство, ИСТИНА) = ИСТИНА
	               |			ТОГДА ""ИзмененоМестонахождениеОС""
	               |		ИНАЧЕ ""ДанныеНеИзменилисьПоОС""
	               |	КОНЕЦ КАК СтатусДвижения,
	               |	МестонахождениеОССрезПоследних1.Организация КАК ОрганизацияСтарое,
	               |	МестонахождениеОССрезПоследних1.ПодразделениеОрганизации КАК ПодразделениеОрганизацииСтарое,
	               |	МестонахождениеОССрезПоследних1.МОЛ КАК МОЛСтарое,
	               |	МестонахождениеОССрезПоследних1.Помещение КАК ПомещениеСтарое,
	               |	ВТ_ДанныеЗагрузки.ИмяДомена КАК СтрокаДомена
	               |ИЗ
	               |	ВТ_ДанныеЗагрузки КАК ВТ_ДанныеЗагрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаАнализа, ) КАК МестонахождениеОССрезПоследних
	               |		ПО ВТ_ДанныеЗагрузки.Подразделение = МестонахождениеОССрезПоследних.ПодразделениеОрганизации
	               |			И ВТ_ДанныеЗагрузки.ФизЛицо = МестонахождениеОССрезПоследних.МОЛ
	               |			И ВТ_ДанныеЗагрузки.Помещение = МестонахождениеОССрезПоследних.Помещение
	               |			И ВТ_ДанныеЗагрузки.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |			И ВТ_ДанныеЗагрузки.Организация = МестонахождениеОССрезПоследних.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаАнализа, ) КАК МестонахождениеОССрезПоследних1
	               |		ПО ВТ_ДанныеЗагрузки.ОсновноеСредство = МестонахождениеОССрезПоследних1.ОсновноеСредство
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(МестонахождениеОССрезПоследних1.ОсновноеСредство, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЕСТЬNULL(МестонахождениеОССрезПоследних.ОсновноеСредство, ИСТИНА) = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |ИТОГИ ПО
	               |	СтатусДвижения,
	               |	Организация";
				   
	Запрос.УстановитьПараметр("ТЗ_КомпьютеровWindowsLDAP"	, ТЗ_КомпьютеровWindowsLDAP);
	Запрос.УстановитьПараметр("ДатаАнализа"	, ТекущаяДата());
	
	Рез_Запроса_ОС = Запрос.Выполнить();
	
	ТаблицаРезультата = Рез_Запроса_ОС.Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Выб_Рез_СтатусДвижения = Рез_Запроса_ОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтатусДвижения");
	Пока Выб_Рез_СтатусДвижения.Следующий() Цикл
		
		Если Ф_Отказ Тогда
			Прервать;	
		КонецЕсли; 
		
		Если Выб_Рез_СтатусДвижения.СтатусДвижения = "ИзмененоМестонахождениеОС" Тогда
			
			Выб_Рез_Организации = Выб_Рез_СтатусДвижения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
			Пока Выб_Рез_Организации.Следующий() Цикл
				
				Если Ф_Отказ Тогда
					Прервать;	
				КонецЕсли;
				
				Док_ПеремещениеОС = Документы.ПеремещениеОС.СоздатьДокумент();
				
				Док_ПеремещениеОС.Дата 			= ТекущаяДата();
				Док_ПеремещениеОС.Организация 	= Выб_Рез_Организации.Организация;
				
				Док_ПеремещениеОС.Ответственный	= Пользователи.ТекущийПользователь();		//Комиссаров: 01/08/2013
				
				Выб_Рез_ДетЗ = Выб_Рез_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
				Пока Выб_Рез_ДетЗ.Следующий() Цикл
					
					//Стр_ОС = Док_ПеремещениеОС.ОсновныеСредства.Добавить(); 				//Комиссаров: 05/08/2013
					//
					//Стр_ОС.ОсновноеСредство 				= Выб_Рез_ДетЗ.ОсновноеСредство;
					//Стр_ОС.ПодразделениеОрганизации 		= Выб_Рез_ДетЗ.Подразделение;
					//Стр_ОС.ПодразделениеОрганизацииСтарое 	= Выб_Рез_ДетЗ.ПодразделениеОрганизацииСтарое;
					//Стр_ОС.МОЛ 								= Выб_Рез_ДетЗ.ФизЛицо;
					//Стр_ОС.МОЛОтправительСтарое 			= Выб_Рез_ДетЗ.МОЛСтарое;
					//Стр_ОС.Помещение 						= Выб_Рез_ДетЗ.Помещение;
					//Стр_ОС.ПомещениеСтарое 					= Выб_Рез_ДетЗ.ПомещениеСтарое;
					
					НоваяСтрока = Док_ПеремещениеОС.СведенияОС.Добавить();
					НоваяСтрока.ОсновноеСредство			= Выб_Рез_ДетЗ.ОсновноеСредство;
					НоваяСтрока.ПодразделениеОрганизации	= Выб_Рез_ДетЗ.Подразделение;
					НоваяСтрока.МОЛ							= Выб_Рез_ДетЗ.ФизЛицо;
					НоваяСтрока.Помещение					= Выб_Рез_ДетЗ.Помещение;
					НоваяСтрока.ИмяДомена          			= Справочники.ИдентификаторыДоменов.НайтиПоНаименованию(Выб_Рез_ДетЗ.СтрокаДомена);
				
					ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ПеремещениеОС", Выб_Рез_ДетЗ.ОсновноеСредство);
					
				КонецЦикла;
				
				//Если Док_ПеремещениеОС.ОсновныеСредства.Количество() > 0 Тогда		//Комиссаров: 06/08/2013
				Если Док_ПеремещениеОС.СведенияОС.Количество() > 0 Тогда
					Попытка
						Если Ф_ПровестиСозданныеДокументы Тогда
							Док_ПеремещениеОС.Записать(РежимЗаписиДокумента.Проведение);
						Иначе
							Док_ПеремещениеОС.Записать();
						КонецЕсли;
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), Ф_Отказ, );
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла; 
			
		ИначеЕсли Выб_Рез_СтатусДвижения.СтатусДвижения = "НовоеОС" Тогда
				
			Выб_Рез_Организации = Выб_Рез_СтатусДвижения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
			Пока Выб_Рез_Организации.Следующий() Цикл
				
				Док_ПоступлениеОС = Документы.ПоступлениеОС.СоздатьДокумент();
				
				Док_ПоступлениеОС.Дата = ТекущаяДата();
				Док_ПоступлениеОС.Организация	= Выб_Рез_Организации.Организация;		//Комиссаров: 24/07/2013
				Док_ПоступлениеОС.Ответственный	= Пользователи.ТекущийПользователь();	//Комиссаров: 24/07/2013
	
				Выб_Рез_ДетЗ = Выб_Рез_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
				Пока Выб_Рез_ДетЗ.Следующий() Цикл
					
					//Стр_ОС = Док_ПоступлениеОС.ОсновныеСредства.Добавить();			//Комиссаров: 05/08/2013
					Стр_ОС = Док_ПоступлениеОС.СведенияОС.Добавить();
					
					Стр_ОС.ОсновноеСредство 				= Выб_Рез_ДетЗ.ОсновноеСредство;
					Стр_ОС.МОЛ 								= Выб_Рез_ДетЗ.ФизЛицо;
					Стр_ОС.Помещение 						= Выб_Рез_ДетЗ.Помещение;
					Стр_ОС.ПодразделениеОрганизации 		= Выб_Рез_ДетЗ.Подразделение;
					Стр_ОС.ИмяДомена          				= Справочники.ИдентификаторыДоменов.НайтиПоНаименованию(Выб_Рез_ДетЗ.СтрокаДомена);
				
					ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ПоступлениеОС", Выб_Рез_ДетЗ.ОсновноеСредство);
					
				КонецЦикла;
				
				//Если Док_ПоступлениеОС.ОсновныеСредства.Количество() > 0 Тогда		//Комиссаров: 06/08/2013
				Если Док_ПоступлениеОС.СведенияОС.Количество() > 0 Тогда
					Попытка
						Если Ф_ПровестиСозданныеДокументы Тогда
							Док_ПоступлениеОС.Записать(РежимЗаписиДокумента.Проведение);
						Иначе	
							Док_ПоступлениеОС.Записать();
						КонецЕсли; 
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), Ф_Отказ, );
					КонецПопытки;
					
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры

//**************************************************** Загрузка из АД *********************************************
Функция ЗагрузитьУчетныеЗаписиИзАДРегламентное(Спр_Настройки, СтруктураНастройки) Экспорт
	
	Ф_НачальныеДанные 				= Ложь;
	Ф_Зафиксировать 				= Ложь;
	Ф_ПровестиСозданныеДокументы 	= Ложь;
	Ф_Отказ                         = Ложь;

	СтруктураНастройки.Свойство("Ф_НачальныеДанные",Ф_НачальныеДанные);
	СтруктураНастройки.Свойство("Ф_ЗафиксироватьДанныеЗагрузки",Ф_Зафиксировать);
	СтруктураНастройки.Свойство("Ф_ПровестиСозданныеДокументы",Ф_ПровестиСозданныеДокументы);
	
	ТЗ_ОписаниеЗагружаемыхОбъектов 	= СоздатьТаблицуСОписаниемЗагрузки();
	
	НачатьТранзакцию(); 		//Комиссаров: 24/07/2013
	
	Для каждого Стр_Подключения Из Спр_Настройки.СписокПодключений Цикл
		
		ИмяДомена 			= СокрЛП(Спр_Настройки.ИмяДомена.Наименование);
		ПарольLDAP 			= СокрЛП(Стр_Подключения.ПарольLDAP);	
		ПользовательLDAP 	= СокрЛП(Стр_Подключения.ПользовательLDAP);
		
		// Фильтр по организации в АД
		ФильтрОрганизация = ?(Спр_Настройки.Ф_ОтбиратьПоОрганизации, СокрЛП(Спр_Настройки.Организация.НаименованиеСинхронизации), Неопределено); 
		
		ТЗ_ПользователейWindowsLDAP = ПолучитьТаблицуПользователейWindowsLDAP(ИмяДомена, ПользовательLDAP, ПарольLDAP, , ФильтрОрганизация);
		ТЗ_КомпьютеровWindowsLDAP 	= ПолучитьТаблицуКомпьютеровWindowsLDAP(ИмяДомена, ПользовательLDAP, ПарольLDAP, ФильтрОрганизация);
		
		// ЗАГРУЗКА ДАННЫХ ПО СПРАВОЧНИКАМ
		ЗагрузитьСправочникиИзАД(ТЗ_ОписаниеЗагружаемыхОбъектов, ТЗ_ПользователейWindowsLDAP, ТЗ_КомпьютеровWindowsLDAP, ФильтрОрганизация, Спр_Настройки.ИмяДомена);
		
		// Заполним организацию и подразделение у физических лиц
		ЗаполнитьРеквизитыФизлиц(ТЗ_ПользователейWindowsLDAP);
		
		Если Ф_НачальныеДанные Тогда
		
			// ВВОД НАЧАЛЬНЫХ ОСТАТКОВ
			ЗагрузитьНачальныеДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ);
			
		Иначе
		
			// ФИКСАЦИЯ ИЗМЕНЕНИЙ ПО АД
			ЗагрузитьИзмененныеДанныеКомпьютеровИзАД(ТЗ_КомпьютеровWindowsLDAP, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	//Комиссаров: 24/07/2013
	Если Ф_Зафиксировать и НЕ Ф_Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		
		СтруктураНастройки.Вставить("Ф_ЗафиксироватьДанныеЗагрузки",Ложь);
	КонецЕсли; 
	
	Возврат(ТЗ_ОписаниеЗагружаемыхОбъектов);
	
КонецФункции

Процедура ЗаполнитьРеквизитыФизлиц(ТаблицаПользователей)
	
	Для каждого ПользовательАД Из ТаблицаПользователей Цикл
		
		Если ПользовательАД.Наименование = "" Тогда
			Продолжить;
		КонецЕсли;
	
		НайденныйЭлемент = Справочники.ФизическиеЛица.НайтиПоРеквизиту("НаименованиеСинхронизации", ПользовательАД.Наименование);
		Если ЗначениеЗаполнено(НайденныйЭлемент)  Тогда
			
			СсылкаОрганизация = Справочники.Организации.НайтиПоРеквизиту("НаименованиеСинхронизации", ПользовательАД.Компания);
			СсылкаПодразделение = Справочники.ПодразделенияОрганизаций.НайтиПоРеквизиту("НаименованиеСинхронизации", ПользовательАД.Отдел, , СсылкаОрганизация);
			
			Если НЕ ЗначениеЗаполнено(НайденныйЭлемент.Организация) 
				И ЗначениеЗаполнено(СсылкаОрганизация) Тогда
				
				ОрганизацияОбъект = НайденныйЭлемент.ПолучитьОбъект();
				ОрганизацияОбъект.Организация 	= СсылкаОрганизация;
				ОрганизацияОбъект.Подразделение = СсылкаПодразделение;
				
			    Попытка
				
					ОрганизацияОбъект.Записать();
				
				Исключение
				
				КонецПопытки;
				
			
			КонецЕсли; 		
		
		КонецЕсли;
	
	КонецЦикла; 
	
	
КонецПроцедуры	


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ДАННЫХ ИЗ 

//**************************************************** Создание описание Таблиц*********************************************
Функция СоздатьТаблицуЗагружаемыхОбъектовВСоставеОС()

	ТаблицаЗагрузки = Новый ТаблицаЗначений;
	ТаблицаЗагрузки.Колонки.Добавить("Computer_Name",  Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаЗагрузки.Колонки.Добавить("Win_Soft",  Новый ОписаниеТипов("СправочникСсылка.ОбъектыКомпьютера"));
	
	//ТаблицаЗагрузки.Колонки.Добавить("ИдентификаторПрограммы",  Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыПрограмм"));
	////ТаблицаЗагрузки.Колонки.Добавить("Организация",  Новый ОписаниеТипов("СправочникСсылка.Организации"));
	////ТаблицаЗагрузки.Колонки.Добавить("ПодразделениеОрганизации",  Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	////ТаблицаЗагрузки.Колонки.Добавить("ИдентификаторДомена", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыДоменов")); 
	
	Возврат ТаблицаЗагрузки;
	
КонецФункции

//**************************************************** Получение данных и запись объектов *********************************************
Процедура ПолучитьДанныеДляЗагрузки(ТаблицаЗагрузки, ТЗ_ОписаниеЗагружаемыхОбъектов, КаталогАнализа, ИдентификаторДомена) Экспорт
	
	//Добавим проверку наличия и доступности каталога загрузки
	Массив_Файлов = НайтиФайлы(КаталогАнализа, "*.*");
	
	Если Массив_Файлов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В каталоге: " + КаталогАнализа + " отсутствуют файлы для загрузки!",,);
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОС = Новый ТаблицаЗначений;
	ЗагруженныеОС.Колонки.Добавить("ОсновноеСредство");
	ЗагруженныеОС.Колонки.Добавить("ДатаЗагрузки");
	
	Для каждого Файл_Обработки Из Массив_Файлов Цикл
		
		Попытка
			ТекстАнализа = Новый ЧтениеТекста(Файл_Обработки.ПолноеИмя, КодировкаТекста.ANSI);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Файл_Обработки.ПолноеИмя);
		КонецПопытки;	
			
		СтрАнализа = ТекстАнализа.ПрочитатьСтроку();
		
		ФизическоеЛицо 	= Справочники.ФизическиеЛица.ПустаяСсылка();
		Computer_Name 	= Справочники.ОсновныеСредства.ПустаяСсылка();
		Ссылка_ОС 		= Справочники.ОсновныеСредства.ПустаяСсылка();
		MAC_Addr 		= "";
		
		System 	= Справочники.SystemID.ПустаяСсылка();	
		CPUName	= Справочники.CPUNameID.ПустаяСсылка();	
		Memory	= 0;	
		HDD		= 0;	
		
		ИсключитьПриЗагрузке = Ложь;
		
		Пока СтрАнализа <> Неопределено Цикл // строки читаются до символа перевода строки
			
			Если Найти(СтрАнализа,"Win_Soft") > 0 Тогда
				
				Софт 		= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 10);
				Софт 		= Прав(Софт, СтрДлина(Софт) - Найти(Софт, "="));
				СсылкаСофт 	= Справочники.ОбъектыКомпьютера.НайтиПоНаименованию(Софт);
				
				Если СсылкаСофт = Справочники.ОбъектыКомпьютера.ПустаяСсылка() Тогда
					
					Если СтрДлина(Софт) <= 3 Тогда
						Спр_Шаблон = Справочники.ШаблоныСоответствийОС.НайтиПоНаименованию(Софт, Истина);	
					Иначе
						Спр_Шаблон = ПолучитьШаблонСоответствияОС(Софт);
					КонецЕсли; 
					
					Если НЕ ЗначениеЗаполнено(Спр_Шаблон) Тогда
					
						Спр_Об = Справочники.ШаблоныСоответствийОС.СоздатьЭлемент();	
					    Спр_Об.Наименование 	= Софт;
						Спр_Об.Записать();
						
						Спр_Шаблон = Спр_Об.Ссылка;
						
						ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ШаблоныСоответствийОС", Софт);
					
					КонецЕсли; 
					
					Спр_Об = Справочники.ОбъектыКомпьютера.СоздатьЭлемент();	
				    Спр_Об.Наименование 		= Софт;
					Спр_Об.ШаблонСоответствия 	= Спр_Шаблон;
					Спр_Об.Записать();
					
					СсылкаСофт  = Спр_Об.Ссылка;
					
					ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "ОбъектыВСоставеОС", Софт);
			
				КонецЕсли;
				
				Стр_ТЗ = ТаблицаЗагрузки.Добавить();
				Стр_ТЗ.Computer_Name 	= Ссылка_ОС;
				Стр_ТЗ.Win_Soft 		= СсылкаСофт;
				
				
			ИначеЕсли Найти(СтрАнализа,"Param_4") > 0 Тогда
				
				//ФизическоеЛицо 	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 8);
				//ФизическоеЛицо 	= Справочники.ФизическиеЛица.НайтиПоРеквизиту("НаименованиеСинхронизации", ФизическоеЛицо);
				//
				//Если НЕ ЗначениеЗаполнено(ФизическоеЛицо) Тогда 
				//	ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В базе отсутствует физическое лицо: " + ФизическоеЛицо, , );
				//	Прервать;
				//КонецЕсли;
				
			ИначеЕсли Найти(СтрАнализа,"Computer_Name") > 0 Тогда
				
				Computer_NameПоиска 	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 14);
				Computer_Name 			= Справочники.ОсновныеСредства.НайтиПоРеквизиту("НаименованиеСинхронизации", Computer_NameПоиска);
				
				Если НЕ ЗначениеЗаполнено(Computer_Name) Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В базе отсутствует ОС: " + Computer_NameПоиска + ", файл: " + Файл_Обработки.ПолноеИмя);
					Прервать;
					
				КонецЕсли;
				
				//Проверим принадлежность к домену
				СтруктураОтбора = Новый Структура("ОсновноеСредство", Computer_Name);
				СтруктураМестонахождения = РегистрыСведений.МестонахождениеОС.ПолучитьПоследнее(ТекущаяДата(), СтруктураОтбора);
				Если СтруктураМестонахождения.ИмяДомена <> ИдентификаторДомена Тогда
					Прервать;
				КонецЕсли;
			
					
				//Запрос = Новый Запрос;
				//Запрос.Текст = "ВЫБРАТЬ
				//|	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера,
				//|	МакАдресаКомпьютеровСрезПоследних.МакАдрес
				//|ИЗ
				//|	РегистрСведений.МакАдресаКомпьютеров.СрезПоследних(
				//|			,
				//|			ИдентификаторКомпьютера = &ИдентификаторКомпьютера
				//|				И МакАдрес ПОДОБНО &МакАдрес) КАК МакАдресаКомпьютеровСрезПоследних
				//|ГДЕ
				//|	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера = &ИдентификаторКомпьютера
				//|	И МакАдресаКомпьютеровСрезПоследних.МакАдрес ПОДОБНО &МакАдрес";
				//
				//Запрос.УстановитьПараметр("ИдентификаторКомпьютера", Computer_Name);
				//Запрос.УстановитьПараметр("МакАдрес", MAC_Addr);
				//
				//Выборка = Запрос.Выполнить().Выбрать();
				//Если Выборка.Количество() = 0 Тогда
				//	
				//	НаборЗаписей = РегистрыСведений.МакАдресаКомпьютеров.СоздатьНаборЗаписей();
				//	НаборЗаписей.Отбор.ИдентификаторКомпьютера.Установить(Computer_Name, Истина);
				//	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата(), Истина);
				//	
				//	НоваяЗапись = НаборЗаписей.Добавить();
				//	НоваяЗапись.Период						= ТекущаяДата();
				//	НоваяЗапись.ИдентификаторКомпьютера		= Computer_Name;
				//	НоваяЗапись.МакАдрес 					= MAC_Addr;
				//	
				//	Попытка
				//		НаборЗаписей.Записать(Истина);
				//	Исключение
				//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				//	КонецПопытки;
				//	
				//КонецЕсли;
				
				
				Ссылка_ОС	=  Computer_Name;
					
				
			ИначеЕсли Найти(СтрАнализа,"Record_Date=") > 0 Тогда
				
				СтрокаДата	 	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 12);
				МассивДаты		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДата, ".");

				Если ЗначениеЗаполнено(Computer_Name) И МассивДаты.Количество() = 3 Тогда
					
					День 	= МассивДаты[0];
					Месяц 	= МассивДаты[1];	
					Год 	= МассивДаты[2];	
					
					День = ?(СтрДлина(День) = 1, "0" + День, День);
					
					ДатаЗагрузки	= Дата(Год + Месяц + День);
					
					НайденнаяСтрока = ЗагруженныеОС.Найти(Computer_Name, "ОсновноеСредство");
					Если НайденнаяСтрока = Неопределено Тогда
						
						НоваяСтрока = ЗагруженныеОС.Добавить();
						НоваяСтрока.ОсновноеСредство = Computer_Name;
						НоваяСтрока.ДатаЗагрузки	= ДатаЗагрузки;
						
					ИначеЕсли НайденнаяСтрока.ДатаЗагрузки < ДатаЗагрузки Тогда
						
						Отбор = Новый Структура;
						Отбор.Вставить("Computer_Name", Computer_Name);
						
						МассивСтрок = ТаблицаЗагрузки.НайтиСтроки(Отбор);
						Для Каждого Стр Из МассивСтрок Цикл
							ТаблицаЗагрузки.Удалить(Стр);
						КонецЦикла;	
						
						НайденнаяСтрока.ДатаЗагрузки = ДатаЗагрузки;
						
					Иначе
						
						Прервать;
						
					КонецЕсли;	
					
				КонецЕсли;	
				
				
			ИначеЕсли Найти(СтрАнализа,"MAC_Addr=") > 0 Тогда
				
				MAC_Addr 	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 9);
				
			ИначеЕсли Найти(СтрАнализа,"System=") > 0 Тогда	
				
				System 	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 7);
				
				СсылкаSystem 	= Справочники.SystemID.НайтиПоНаименованию(System);
				Если СсылкаSystem = Справочники.SystemID.ПустаяСсылка() Тогда
					
					ОбъектSystem = Справочники.SystemID.СоздатьЭлемент();	
				    ОбъектSystem.Наименование 		= System;
					ОбъектSystem.Записать();
					
					СсылкаSystem  = ОбъектSystem.Ссылка;
					
				КонецЕсли;
				
			ИначеЕсли Найти(СтрАнализа,"CPU.BrandName=") > 0 Тогда
				
				CPUName	= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 14);
				
				СсылкаCPUName 	= Справочники.CPUNameID.НайтиПоНаименованию(CPUName);
				Если СсылкаCPUName = Справочники.CPUNameID.ПустаяСсылка() Тогда
					
					ОбъектCPUName = Справочники.CPUNameID.СоздатьЭлемент();	
				    ОбъектCPUName.Наименование 		= CPUName;
					ОбъектCPUName.Записать();
					
					СсылкаCPUName  = ОбъектCPUName.Ссылка;
					
				КонецЕсли;
				
			ИначеЕсли Найти(СтрАнализа,"Memory_in_Mb=") > 0 Тогда
				
				Memory		= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 13);
				ЧислоMemory	= Число(Memory);
				
			ИначеЕсли Найти(СтрАнализа,"Total_HDD_in_Mb=") > 0 Тогда
				
				HDD			= Прав(СтрАнализа, СтрДлина(СтрАнализа) - 16);
				ЧислоHDD	= Число(HDD);
				
			КонецЕсли;
			
		    СтрАнализа = ТекстАнализа.ПрочитатьСтроку();
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//			   |	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера,
		//			   |	МакАдресаКомпьютеровСрезПоследних.МакАдрес,
		//			   |	МакАдресаКомпьютеровСрезПоследних.System,
		//			   |	МакАдресаКомпьютеровСрезПоследних.CPUName,
		//			   |	МакАдресаКомпьютеровСрезПоследних.Memory,
		//			   |	МакАдресаКомпьютеровСрезПоследних.HDD
		//			   |ИЗ
		//			   |	РегистрСведений.МакАдресаКомпьютеров.СрезПоследних(
		//			   |			&Дата,
		//			   |			ИдентификаторКомпьютера = &ИдентификаторКомпьютера
		//			   |				И МакАдрес ПОДОБНО &МакАдрес) КАК МакАдресаКомпьютеровСрезПоследних
		//			   |ГДЕ
		//			   |	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера = &ИдентификаторКомпьютера
		//			   |	И МакАдресаКомпьютеровСрезПоследних.МакАдрес ПОДОБНО &МакАдрес";
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера,
		               |	МакАдресаКомпьютеровСрезПоследних.МакАдрес,
		               |	МакАдресаКомпьютеровСрезПоследних.System,
		               |	МакАдресаКомпьютеровСрезПоследних.CPUName,
		               |	МакАдресаКомпьютеровСрезПоследних.Memory,
		               |	МакАдресаКомпьютеровСрезПоследних.HDD
		               |ИЗ
		               |	РегистрСведений.МакАдресаКомпьютеров.СрезПоследних(&Дата, ИдентификаторКомпьютера = &ИдентификаторКомпьютера) КАК МакАдресаКомпьютеровСрезПоследних
		               |ГДЕ
		               |	МакАдресаКомпьютеровСрезПоследних.ИдентификаторКомпьютера = &ИдентификаторКомпьютера";
		
					   
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("ИдентификаторКомпьютера", Computer_Name);
		Запрос.УстановитьПараметр("МакАдрес", MAC_Addr);
		
		НаборЗаписей = РегистрыСведений.МакАдресаКомпьютеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторКомпьютера.Установить(Computer_Name, Истина);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата(), Истина);
		
		НаборЗаписей.Прочитать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 
			ИЛИ НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период						= ТекущаяДата();
			
			НоваяЗапись.ИдентификаторКомпьютера		= Computer_Name;
			НоваяЗапись.МакАдрес 					= MAC_Addr;
			
			НоваяЗапись.System						= СсылкаSystem;
			НоваяЗапись.CPUName						= СсылкаCPUName;
			НоваяЗапись.Memory						= ЧислоMemory;
			НоваяЗапись.HDD							= ЧислоHDD;
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());		
			КонецПопытки;
			
		Иначе
			
			Выборка.Следующий();
			
			Если Выборка.System 		<> СсылкаSystem 
				ИЛИ Выборка.CPUName 	<> СсылкаCPUName 
				ИЛИ Выборка.Memory 		<> ЧислоMemory
				ИЛИ Выборка.HDD 	<> ЧислоHDD 
				ИЛИ Выборка.МакАдрес 	<> MAC_Addr Тогда
				
				
				НоваяЗапись = НаборЗаписей[0];
				//НоваяЗапись.Период						= ТекущаяДата();
				//
				//НоваяЗапись.ИдентификаторКомпьютера		= Computer_Name;
				НоваяЗапись.МакАдрес 					= MAC_Addr;
				
				НоваяЗапись.System						= СсылкаSystem;
				НоваяЗапись.CPUName						= СсылкаCPUName;
				НоваяЗапись.Memory						= ЧислоMemory;
				НоваяЗапись.HDD							= ЧислоHDD;
				
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());		
				КонецПопытки;
				
			КонецЕсли;
					
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьШаблонСоответствияОС(Софт)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныСоответствийОС.Ссылка,
	               |	ШаблоныСоответствийОС.Наименование
	               |ИЗ
	               |	Справочник.ШаблоныСоответствийОС КАК ШаблоныСоответствийОС
	               |ГДЕ
	               |	&НаименованиеСофта ПОДОБНО ""%"" + ШаблоныСоответствийОС.Наименование + ""%""";
	Запрос.УстановитьПараметр("НаименованиеСофта",Софт);
	ТЗ_Шаблонов = Запрос.Выполнить().Выгрузить();
	
	СсылкаНашаблон = Справочники.ШаблоныСоответствийОС.ПустаяСсылка();
	КолСимволов = 0;
	Для каждого Стр_Шаблон Из ТЗ_Шаблонов Цикл
	
		Если СтрДлина(Стр_Шаблон.Наименование) > КолСимволов Тогда
			КолСимволов 	= СтрДлина(Стр_Шаблон.Наименование);	
			СсылкаНашаблон 	= Стр_Шаблон.Ссылка;
		КонецЕсли;
	
	КонецЦикла; 
	
	Возврат СсылкаНашаблон;
	
КонецФункции
Процедура ЗагрузитьДанныеПоОбъектам(ТаблицаЗагрузки, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ, ИмяДомена) Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВР = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВР;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазмещениеОбъектов.ИдентификаторКомпьютера,
	               |	РазмещениеОбъектов.ОбъектКомпьютера,
	               |	РазмещениеОбъектов.КоличествоОстаток
	               |ПОМЕСТИТЬ ВР_Данные
	               |ИЗ
	               |	РегистрНакопления.РазмещениеОбъектов.Остатки(, ИдентификаторДомена = &ИдентификаторДомена) КАК РазмещениеОбъектов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Софт.Computer_Name,
	               |	Софт.Win_Soft
	               |ПОМЕСТИТЬ ВР_ДанныеЗагрузки
	               |ИЗ
	               |	&ТаблицаЗагрузки КАК Софт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВР_Данные.ИдентификаторКомпьютера, ВР_ДанныеЗагрузки.Computer_Name) КАК ИдентификаторКомпьютера,
	               |	ЕСТЬNULL(ВР_Данные.ОбъектКомпьютера, ВР_ДанныеЗагрузки.Win_Soft) КАК ОбъектКомпьютера,
	               |	ВР_Данные.КоличествоОстаток,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВР_Данные.ИдентификаторКомпьютера, ИСТИНА) = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ф_Добавлено,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВР_ДанныеЗагрузки.Computer_Name, ИСТИНА) = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ф_Списано
	               |ИЗ
	               |	ВР_Данные КАК ВР_Данные
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВР_ДанныеЗагрузки КАК ВР_ДанныеЗагрузки
	               |		ПО ВР_Данные.ИдентификаторКомпьютера = ВР_ДанныеЗагрузки.Computer_Name
	               |			И ВР_Данные.ОбъектКомпьютера = ВР_ДанныеЗагрузки.Win_Soft
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВР_Данные.ИдентификаторКомпьютера,
	               |	ВР_Данные.ОбъектКомпьютера";
	
				   
	Запрос.УстановитьПараметр("ТаблицаЗагрузки"	, ТаблицаЗагрузки);
	Запрос.УстановитьПараметр("ИдентификаторДомена"	, ИмяДомена);

	
	ТаблицаОсновная = Запрос.Выполнить().Выгрузить();
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Док_КомплектацияОбъектовОС = Документы.КомплектацияОбъектовОС.СоздатьДокумент();
	
	Док_КомплектацияОбъектовОС.Дата 			= ТекущаяДата();
	Док_КомплектацияОбъектовОС.Комментарий 		= "Загружено автоматически.";
	Док_КомплектацияОбъектовОС.Ответственный 	= Пользователи.ТекущийПользователь(); 
	Док_КомплектацияОбъектовОС.ИдентификаторДомена 	= ИмяДомена; 
	
	Для каждого СтрокаТаблицаОсновная Из ТаблицаОсновная Цикл
		
		Если УправлениеОсновнымиСредствамиСервер.ИсключатьПриЗагрузке(СтрокаТаблицаОсновная.ИдентификаторКомпьютера) Тогда
			Продолжить;
		КонецЕсли;
		
		Если УправлениеОсновнымиСредствамиСервер.ИсключатьПослеСписания(СтрокаТаблицаОсновная.ИдентификаторКомпьютера) Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если СтрокаТаблицаОсновная.Ф_Добавлено Тогда
		
			Стр_ОС = Док_КомплектацияОбъектовОС.ОсновныеСредства.Найти(СтрокаТаблицаОсновная.ИдентификаторКомпьютера,"ОсновноеСредство");
			Если Стр_ОС = Неопределено Тогда
				Стр_ОС = Док_КомплектацияОбъектовОС.ОсновныеСредства.Добавить();
				
				Стр_ОС.ОсновноеСредство = СтрокаТаблицаОсновная.ИдентификаторКомпьютера;
				Стр_ОС.КлючСвязи 		= РаботаСТабличнымиЧастямиСервер.СоздатьНовыйКлючСвязи(Док_КомплектацияОбъектовОС, "ОсновныеСредства");
				
				//Стр_ОС.Организация					= СтрокаТаблицаОсновная.Организация;
				//Стр_ОС.ПодразделениеОрганизации		= СтрокаТаблицаОсновная.ПодразделениеОрганизации;
				
			КонецЕсли; 
			
			Стр_Комплект = Док_КомплектацияОбъектовОС.Комплектующие.Добавить();
			
			Стр_Комплект.Объект 			= СтрокаТаблицаОсновная.ОбъектКомпьютера;
			Стр_Комплект.КлючСвязи 			= Стр_ОС.КлючСвязи;
			Стр_Комплект.Количество 		= 1;
			
			ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "КомплектацияОбъектовОС", Стр_Комплект.Объект);
			
		ИначеЕсли СтрокаТаблицаОсновная.Ф_Списано Тогда
			
			Стр_ОС = Док_КомплектацияОбъектовОС.ОсновныеСредства.Найти(СтрокаТаблицаОсновная.ИдентификаторКомпьютера,"ОсновноеСредство");
			Если Стр_ОС = Неопределено Тогда
				Стр_ОС = Док_КомплектацияОбъектовОС.ОсновныеСредства.Добавить();
				
				Стр_ОС.ОсновноеСредство = СтрокаТаблицаОсновная.ИдентификаторКомпьютера;
				Стр_ОС.КлючСвязи 		= РаботаСТабличнымиЧастямиСервер.СоздатьНовыйКлючСвязи(Док_КомплектацияОбъектовОС, "ОсновныеСредства");
				
				//Стр_ОС.Организация					= СтрокаТаблицаОсновная.Организация;
				//Стр_ОС.ПодразделениеОрганизации		= СтрокаТаблицаОсновная.ПодразделениеОрганизации;
				
			КонецЕсли; 
			
			Стр_Комплект = Док_КомплектацияОбъектовОС.Комплектующие.Добавить();
			
			Стр_Комплект.Объект 			= СтрокаТаблицаОсновная.ОбъектКомпьютера;
			Стр_Комплект.КлючСвязи 			= Стр_ОС.КлючСвязи;
			Стр_Комплект.Количество 		= СтрокаТаблицаОсновная.КоличествоОстаток * -1;
			
			ДобавитьСтрокуВТЗОписание(ТЗ_ОписаниеЗагружаемыхОбъектов, "КомплектацияОбъектовОС", Стр_Комплект.Объект);
				
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Док_КомплектацияОбъектовОС.ОсновныеСредства.Количество() > 0 Тогда
		Попытка
			Если Ф_ПровестиСозданныеДокументы Тогда
				Док_КомплектацияОбъектовОС.Записать(РежимЗаписиДокумента.Проведение);
			Иначе	
				Док_КомплектацияОбъектовОС.Записать();
			КонецЕсли; 
		Исключение
			//ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ОписаниеОшибки(), Ф_Отказ, ); 		//Комиссаров: 31/07/2013
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

//**************************************************** Загрузка из  *********************************************
Функция ЗагрузитьДанныеИзРегламентное(Спр_Настройки, СтруктураНастройки) Экспорт
	
	Ф_Зафиксировать 				= Ложь;
	Ф_ПровестиСозданныеДокументы 	= Ложь;
	Ф_Отказ                         = Ложь;

	СтруктураНастройки.Свойство("Ф_ЗафиксироватьДанныеЗагрузки",Ф_Зафиксировать);
	СтруктураНастройки.Свойство("Ф_ПровестиСозданныеДокументы",Ф_ПровестиСозданныеДокументы);
	
	ТЗ_ОписаниеЗагружаемыхОбъектов 		= СоздатьТаблицуСОписаниемЗагрузки();
	ТЗ_ЗагружаемыхОбъектовВСоставеОС 	= СоздатьТаблицуЗагружаемыхОбъектовВСоставеОС();
	
	НачатьТранзакцию();
	
	Для каждого Стр_Каталога Из Спр_Настройки.РасположениеИнформацииОбОбъектахВОС Цикл
		
		КаталогАнализа = Стр_Каталога.КаталогЗагрузки;
		
		ПолучитьДанныеДляЗагрузки(ТЗ_ЗагружаемыхОбъектовВСоставеОС, ТЗ_ОписаниеЗагружаемыхОбъектов, КаталогАнализа, Спр_Настройки.ИмяДомена);
		
		ЗагрузитьДанныеПоОбъектам(ТЗ_ЗагружаемыхОбъектовВСоставеОС, ТЗ_ОписаниеЗагружаемыхОбъектов, Ф_ПровестиСозданныеДокументы, Ф_Отказ, Спр_Настройки.ИмяДомена);
		
	КонецЦикла; 
	
	Если Ф_Зафиксировать и НЕ Ф_Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		
		СтруктураНастройки.Вставить("Ф_ЗафиксироватьДанныеЗагрузки",Ложь);
	КонецЕсли; 
	
	Возврат(ТЗ_ОписаниеЗагружаемыхОбъектов);
	
КонецФункции

// Процедура запуска загрузки из регламентного задания
Процедура ЗагрузкаДанныхКомпьютеровОбъектов() Экспорт
	
	НастройкаПолученияДанныхОС = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПолученияДанныхОС.Ссылка,
	               |	НастройкиПолученияДанныхОС.ОбновлятьКомпьютеры,
	               |	НастройкиПолученияДанныхОС.ОбновлятьОбъекты
	               |ИЗ
	               |	Справочник.НастройкиПолученияДанныхОС КАК НастройкиПолученияДанныхОС
	               |ГДЕ
	               |	НЕ НастройкиПолученияДанныхОС.ПометкаУдаления";
				   
	Выборка = Запрос.Выполнить().Выбрать();			   
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Ф_ЗафиксироватьДанныеЗагрузки",	Истина);
	СтруктураНастройки.Вставить("Ф_ПровестиСозданныеДокументы", 	Истина);
	СтруктураНастройки.Вставить("Ф_НачальныеДанные",	Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		НастройкаПолученияДанныхОС = Выборка.Ссылка;
		
		Если ЗначениеЗаполнено(НастройкаПолученияДанныхОС) Тогда
			
			Если Выборка.ОбновлятьКомпьютеры Тогда
				ТаблицаКомпьютеров = УправлениеУчетнымиЗаписямиСервер.ЗагрузитьУчетныеЗаписиИзАДРегламентное(НастройкаПолученияДанныхОС, СтруктураНастройки);
			КонецЕсли;	
			
			Если Выборка.ОбновлятьОбъекты Тогда
				ТаблицаОбъектов = УправлениеУчетнымиЗаписямиСервер.ЗагрузитьДанныеИзРегламентное(НастройкаПолученияДанныхОС, СтруктураНастройки);
			КонецЕсли;
			
		КонецЕсли;	
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриПроведенииСписаниеОСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
	
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Дата", Источник.Дата);
		СтруктураДанных.Вставить("Наименование", "Удалить программы с компьютеров");
		СтруктураДанных.Вставить("Предмет", Источник.Ссылка);
		СтруктураДанных.Вставить("РольИсполнителя", Справочники.РолиИсполнителей.СистемныйАдминистратор);
		
		Если НЕ Отказ Тогда
			ГоловнойБизнесПроцесс = СоздатьИЗапуститьБизнесПроцесс(СтруктураДанных);
		КонецЕсли;
		
		//Оповестим пользователей об осободившихся после списания ОС лицензиях
		Если НЕ Отказ Тогда
			
			Описание = "";
			
			Для каждого Движение ИЗ Источник.Движения.ЛицензииОрганизации Цикл
				
				Если Движение.ВидДвижения <> ВидДвиженияНакопления.Приход Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаОписания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 (%2):  %3 ед.'"),
						Движение.Лицензия.Наименование, Движение.Организация.Наименование, Формат(Движение.Количество, "ЧЦ=5"));
				Описание  = Описание + СтрокаОписания + Символы.ПС;
				
			КонецЦикла;
			
			Если Описание <> "" Тогда
				
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Дата", Источник.Дата);
				СтруктураДанных.Вставить("Наименование", "Освободились лицензии при списании ОС");
				//СтруктураДанных.Вставить("Предмет", ГоловнойБизнесПроцесс);
				СтруктураДанных.Вставить("Предмет", Источник.Ссылка);
				СтруктураДанных.Вставить("РольИсполнителя", Справочники.РолиИсполнителей.СистемныйАдминистратор);
				СтруктураДанных.Вставить("Описание", Описание);
				
				ПодчиненныйБизнесПроцесс = СоздатьИЗапуститьБизнесПроцесс(СтруктураДанных);
				
			КонецЕсли;	
				
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриПроведенииРаспределениеЛицензийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ Отказ И РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		
		Описание = "";
	
		Для каждого Движение ИЗ Источник.Движения.ЛицензииОрганизации Цикл
			
			Если Движение.ВидДвижения <> ВидДвиженияНакопления.Приход Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОписания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 (%2):  %3 ед.'"),
			Движение.Лицензия.Наименование, Движение.Организация.Наименование, Формат(Движение.Количество, "ЧЦ=5"));
			Описание  = Описание + СтрокаОписания + Символы.ПС;
			
		КонецЦикла;
		
		Если Описание <> "" Тогда
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Дата", Источник.Дата);
			СтруктураДанных.Вставить("Наименование", "Освободились лицензии при респределении");
			СтруктураДанных.Вставить("Предмет", Источник.Ссылка);
			СтруктураДанных.Вставить("РольИсполнителя", Справочники.РолиИсполнителей.СистемныйАдминистратор);
			СтруктураДанных.Вставить("Описание", Описание);
			
			ПодчиненныйБизнесПроцесс = СоздатьИЗапуститьБизнесПроцесс(СтруктураДанных);
			
		КонецЕсли;	
				
	КонецЕсли;	
	
КонецПроцедуры


Процедура ПерепровестиСписокДокументовТребующихПерепроведения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыТребующиеПерепроведения.Документ
		|ИЗ
		|	РегистрСведений.ДокументыТребующиеПерепроведения КАК ДокументыТребующиеПерепроведения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыТребующиеПерепроведения.ДатаДокумента";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДокументыТребующиеПерепроведения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ  = ВыборкаДетальныеЗаписи.Документ;
		
		МенеджерЗаписи.Прочитать();
		
		Попытка
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				
				НаборЗаписей = РегистрыНакопления.РазмещениеОбъектов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Документ);
				
				НаборЗаписей.Прочитать();
				
				Для каждого Запись Из НаборЗаписей Цикл
				
					ИдентификаторПрограммы = Запись.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы;
					Если ЗначениеЗаполнено(ИдентификаторПрограммы) И Запись.ИдентификаторПрограммы <> ИдентификаторПрограммы Тогда
					
						Запись.ИдентификаторПрограммы = ИдентификаторПрограммы;			
					
					КонецЕсли;	
				
				КонецЦикла; 
				
				НаборЗаписей.Записать();
				
			Иначе	
				
				ДокументОбъект = ВыборкаДетальныеЗаписи.Документ.ПолучитьОбъект();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЕсли;	
			
			МенеджерЗаписи.Удалить();
		
		Исключение
			
			МенеджерЗаписи.КоличествоНеудачныхПроведений = Запись.КоличествоНеудачныхПроведений + 1;
			МенеджерЗаписи.СообщениеОбОшибкеПроведения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			МенеджерЗаписи.Записать();
			
			ИмяСобытия = НСтр("ru = 'Документы, требующие допроведения'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(
				ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры //ПерепровестиСписокДокументовТребующихПерепроведения	


Функция СформироватьСписокДокументовТребующихПерепроведения(ШаблонСоответствия)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Регистратор
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		РазмещениеОбъектов.Регистратор КАК Регистратор
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеОбъектов КАК РазмещениеОбъектов
	               |	ГДЕ
	               |		РазмещениеОбъектов.ОбъектКомпьютера В
	               |				(ВЫБРАТЬ
	               |					ОбъектыКомпьютера.Ссылка
	               |				ИЗ
	               |					Справочник.ОбъектыКомпьютера КАК ОбъектыКомпьютера
	               |				ГДЕ
	               |					ОбъектыКомпьютера.ШаблонСоответствия = &ШаблонСоответствия)) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВложенныйЗапрос.Регистратор.Дата";
				   
	Запрос.УстановитьПараметр("ШаблонСоответствия", ШаблонСоответствия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.ДокументыТребующиеПерепроведения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Регистратор);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Документ = Выборка.Регистратор;
			НоваяЗапись.ДатаДокумента	= Выборка.Регистратор.Дата;
			
			Попытка
			
				НаборЗаписей.Записать();	
			
			Исключение
				
				ИмяСобытия = НСтр("ru = 'Документы, требующие допроведения'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				
				ЗаписьЖурналаРегистрации(
					ИмяСобытия,
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			КонецПопытки;
			
		КонецЕсли;	
	
	КонецЦикла; 
	
КонецФункции //СформироватьСписокДокументовТребующихПерепроведения	


Процедура ПередЗаписьюШаблоныСоответствияОСПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоНовый() 
		ИЛИ Источник.ИдентификаторПрограммы = Справочники.ШаблоныСоответствийОС.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйШаблонСоответствияОС = Источник.Ссылка.ИдентификаторПрограммы;
	Если Источник.ИдентификаторПрограммы <> СтарыйШаблонСоответствияОС Тогда
		
		Результат = СформироватьСписокДокументовТребующихПерепроведения(Источник.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры



