
// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеОССведенияОС.Ссылка КАК Регистратор,
	               |	ПеремещениеОССведенияОС.Ссылка.Дата КАК Период,
	               |	ПеремещениеОССведенияОС.ОсновноеСредство,
	               |	ПеремещениеОССведенияОС.Ссылка.Организация КАК Организация,
	               |	ПеремещениеОССведенияОС.ПодразделениеОрганизации,
	               |	ПеремещениеОССведенияОС.МОЛ КАК МОЛ,
	               |	ПеремещениеОССведенияОС.Помещение КАК Помещение,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОСВладелец,
	               |	ПеремещениеОССведенияОС.ИмяДомена
	               |ИЗ
	               |	Документ.ПеремещениеОС.СведенияОС КАК ПеремещениеОССведенияОС
	               |ГДЕ
	               |	ПеремещениеОССведенияОС.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()


 // <Описание функции>
 //
 // Параметры
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ПолучитьТаблицуОтключенныеКомпьютеры(ДополнительныеСвойства) Экспорт
 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ПеремещениеОССведенияОС.Ссылка КАК Регистратор,
	                |	ПеремещениеОССведенияОС.Ссылка.Дата КАК Период,
	                |	ПеремещениеОССведенияОС.ОсновноеСредство КАК ИдентификаторКомпьютера,
	                |	ЛОЖЬ КАК Отключен
	                |ИЗ
	                |	Документ.ПеремещениеОС.СведенияОС КАК ПеремещениеОССведенияОС
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтключенныеКомпьютеры.СрезПоследних(&МоментВремени, ) КАК ОтключенныеКомпьютерыСрезПоследних
	                |		ПО ПеремещениеОССведенияОС.ОсновноеСредство = ОтключенныеКомпьютерыСрезПоследних.ИдентификаторКомпьютера
	                |ГДЕ
	                |	ПеремещениеОССведенияОС.Ссылка = &Ссылка
	                |	И ОтключенныеКомпьютерыСрезПоследних.Отключен";
	 
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДополнительныеСвойства.ДляПроведения.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	 
	 Возврат(Запрос.Выполнить().Выгрузить());
 
 КонецФункции // ПолучитьТаблицуОтключенныеКомпьютеры()

