
&НаСервере
// Функция помещает результаты подбора в хранилище
//
Функция ЗаписатьПодборВХранилище() 
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаНеобходимыхЛицензий", 		ТаблицаНеобходимыхЛицензий.Выгрузить());
	СтруктураТаблиц.Вставить("ТаблицаНеобходимойПоддержки", 	ТаблицаНеобходимойПоддержки.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураТаблиц);
	
КонецФункции

&НаКлиенте
//Процедура - обработчик нажатия кнопки ОК.
//
Процедура ОК(Команда)
	
	АдресЗапасовВХранилище = ЗаписатьПодборВХранилище();
	
	Закрыть(АдресЗапасовВХранилище);
	
КонецПроцедуры // ОК()

&НаСервере
Процедура СформироватьДанныеПоЛицензиямНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.ИдентификаторПрограммы КАК Наименование,
	               |	ВложенныйЗапрос.НеобходимоеКоличество КАК Количество,
	               |	ВложенныйЗапрос.Программа
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |		СУММА(1) КАК НеобходимоеКоличество,
	               |		ВложенныйЗапрос.Программа КАК Программа
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ОсновноеСредство,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы КАК Программа
	               |		ИЗ
	               |			РегистрНакопления.РазмещениеОбъектов.Остатки КАК РазмещениеОбъектовОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы,
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.ИдентификаторПрограммы,
	               |		ВложенныйЗапрос.Программа) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.ИдентификаторПрограммы В(&СписокИдентификаторПрограммы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоддержкаЛицензий.ОсновноеСредство КАК НаименованиеЛицензии,
	               |	ДОБАВИТЬКДАТЕ(ПоддержкаЛицензий.ДатаНачала, МЕСЯЦ, ПоддержкаЛицензий.СрокДействия_Месяц) КАК ДатаНачала,
	               |	ПоддержкаЛицензий.ОсновноеСредство.ИдентификаторПрограммы КАК Программа
	               |ИЗ
	               |	РегистрСведений.ПоддержкаЛицензий КАК ПоддержкаЛицензий
	               |ГДЕ
	               |	ДОБАВИТЬКДАТЕ(ПоддержкаЛицензий.ДатаНачала, МЕСЯЦ, ПоддержкаЛицензий.СрокДействия_Месяц) <= &ДатаАнализа";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("СписокИдентификаторПрограммы",ТаблицаНастройкиПоПолученияЛицензий.Выгрузить());
	
	МассивТаблицЗакупок = Запрос.ВыполнитьПакет();
	
	ТаблицаНеобходимыхЛицензий.Загрузить(МассивТаблицЗакупок[0].Выгрузить());
	ТаблицаНеобходимойПоддержки.Загрузить(МассивТаблицЗакупок[1].Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеПоПлану(Команда)

	СформироватьДанныеПоЛицензиямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаАнализа") Тогда
		ДатаАнализа = Параметры.ДатаАнализа;
	Иначе
		ДатаАнализа = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры
