&наСервере	
Функция СформироватьРаспределениеНаСервере(СтруктураДокумента)
	
	НовыйДокумент = Документы.РаспределениеЛицензий.СоздатьДокумент();
	НовыйДокумент.Заполнить(СтруктураДокумента);
	
	НовыйДокумент.Дата = СтруктураДокумента.Дата;
	
	Для каждого ТабличнаяЧасть Из СтруктураДокумента.ТабличныеЧасти Цикл
		
		НовыйДокумент[ТабличнаяЧасть.Ключ].Загрузить(ТабличнаяЧасть.Значение);
		
	КонецЦикла;	
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		ОбновитьТаблицу();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;	
		
КонецФункции	

&наСервере	
Процедура СформироватьРаспределенияНаСервере()
	
	Если Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта Тогда
	
		//Сформируем массив организаций
		СтруктураОтбора = Новый Структура("Флаг", Истина);
		ТаблицаРезультата = Объект.ОсновныеСредства.Выгрузить(СтруктураОтбора);
		
		//ТаблицаРезультата.Свернуть("Организация", "");
		//МассивОрганизаций = ТаблицаРезультата.ВыгрузитьКолонку("Организация");
		МассивОрганизаций = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаРезультата, "Организация", Истина);
		
		Для каждого Организация Из МассивОрганизаций Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Флаг", Истина);
			СтруктураОтбора.Вставить("Организация", Организация);
			
			ОсновныеСредства = Объект.ОсновныеСредства.Выгрузить(СтруктураОтбора);
			
			СтруктураДокумента = Новый Структура;
			СтруктураДокумента.Вставить("Дата", ТекущаяДата());
			СтруктураДокумента.Вставить("Организация", Организация);
			СтруктураДокумента.Вставить("Ответственный", Пользователи.ТекущийПользователь());
			
			СтруктураДокумента.Вставить("ТабличныеЧасти", Новый Структура("ОсновныеСредства", ОсновныеСредства));
			
			НовыйДокумент = СформироватьРаспределениеНаСервере(СтруктураДокумента);
			
		КонецЦикла;	
	
	Иначе
		
	КонецЕсли;	
	
КонецПроцедуры //СформироватьРазмещениеНаСервере

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьРаспределенияНаСервере();
КонецПроцедуры //Сформировать

&НаСервере
Процедура ОбновитьТаблицу()
	
	Если Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта Тогда
		ТаблицаРезультата = Обработки.АнализЖивогоИМертвогоСофта.ЗаполнитьМертвыйСофт();
	Иначе
		ТаблицаРезультата = Обработки.АнализЖивогоИМертвогоСофта.ЗаполнитьЖивойСофт();	
	КонецЕсли;
	
	Объект.ОсновныеСредства.Загрузить(ТаблицаРезультата);
	
КонецПроцедуры //ОбновитьТаблицу	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантОтчета) Тогда
		Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта;
	КонецЕсли;
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьТаблицу();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВыбор(Выбор)
	Для Каждого Строка Из Объект.ОсновныеСредства Цикл
		Строка.Флаг = Выбор;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьВыбор(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	УстановитьВыбор(Ложь);	
КонецПроцедуры
